window.QURAN_MAP_DATA = [
  {
    "surah_id": "1",
    "name": "Al-Fatihah",
    "reveal": "มักกิยยะฮฺ",
    "max_ayat": 7,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "เกี่ยวกับอัลลอฮฺ"
      },
      {
        "ayat_range": "5",
        "theme": "การอิบาดะฮฺและขอความช่วยเหลือจากอัลลอฮฺเท่านั้น"
      },
      {
        "ayat_range": "6-7",
        "theme": "แนวทางชีวิตที่เที่ยงตรง"
      }
    ],
    "content_detail": "สูเราะฮฺมักกิยยะฮฺ จำนวน 7 อายะฮฺ “อัลฟาติหะฮฺ” (الفَاتِحَةُ) คือสูเราะฮฺที่สำคัญและยิ่งใหญ่ที่สุด และเป็นรุกุ่น (ข้อบังคับ) หนึ่งของการละหมาด อัลลอฮฺทรงเปิดคัมภีร์อัลกุรอานด้วยกับสูเราะฮฺนี้ “อัลฟาติหะฮฺ” (الفَاتِحَةُ) หมายถึง “บทเปิด”, “บทนำ\" หรือ “ปฐมบท” และยังถูกเรียกว่า \"อุมมุลกิตาบ” (อُمُّ คِتَابِ) หมายถึง “แม่บทของคัมภีร์” เพราะเนื้อหาของสูเราะฮฺครอบคลุมเรื่องราวที่สำคัญที่สุดสำหรับมนุษย์ ได้แก่"
  },
  {
    "surah_id": "2",
    "name": "Al-Baqarah",
    "reveal": "มะดะนิยยะฮฺ",
    "max_ayat": 286,
    "thematic_ayat": [
      {
        "ayat_range": "1-5",
        "theme": "มุตตะกีน (ผู้ศรัทธาที่ยำเกรง)"
      },
      {
        "ayat_range": "6-7",
        "theme": "กาฟิร (ผู้ปฏิเสธศรัทธา)"
      },
      {
        "ayat_range": "8-20",
        "theme": "มุนาฟิก (ผู้ที่กลับกลอก)"
      },
      {
        "ayat_range": "1-20",
        "theme": "ประเภทของคน"
      },
      {
        "ayat_range": "21-29",
        "theme": "คำเรียกร้องสู่การเป็นบ่าวของอัลลอฮฺ"
      },
      {
        "ayat_range": "30-39",
        "theme": "เรื่องราวของนบีอาดัม"
      },
      {
        "ayat_range": "21-39",
        "theme": "การเป็นบ่าวของอัลลอฮฺ"
      },
      {
        "ayat_range": "40-121",
        "theme": "เรื่องราวของบนีอิสรออีล"
      },
      {
        "ayat_range": "122-123",
        "theme": "คำแนะนำตักเตือนแก่พวกเขา"
      },
      {
        "ayat_range": "40-123",
        "theme": "ตัวอย่างที่ไม่ดี"
      },
      {
        "ayat_range": "124-141",
        "theme": "เรื่องราวของนบีอิบรอฮีม"
      },
      {
        "ayat_range": "142-152",
        "theme": "เกี่ยวกับกิบละฮฺ (ทิศละหมาด)"
      },
      {
        "ayat_range": "124-152",
        "theme": "ตัวอย่างที่ดี"
      },
      {
        "ayat_range": "40-152",
        "theme": "ตัวอย่างการเป็นบ่าว"
      },
      {
        "ayat_range": "153-158",
        "theme": "การทดสอบ"
      },
      {
        "ayat_range": "159-167",
        "theme": "สัญลักษณ์ของการเป็นบ่าว"
      },
      {
        "ayat_range": "168-219",
        "theme": "ชีวิตและการอิบาดะฮฺในรูปแบบต่าง ๆ"
      },
      {
        "ayat_range": "220-242",
        "theme": "ครอบครัวและบทบัญญัติต่าง ๆ"
      },
      {
        "ayat_range": "243-253",
        "theme": "เรื่องราวของฏอลูตและญาลูต"
      },
      {
        "ayat_range": "153-253",
        "theme": "หลากหลายเรื่องราวเกี่ยวกับการอิบาดะฮฺ"
      },
      {
        "ayat_range": "254-260",
        "theme": "อายะฮฺกุรซีย์และการยืนยันในเอกานุภาพของอัลลอฮฺ"
      },
      {
        "ayat_range": "261-283",
        "theme": "การบริจาคและเสียสละคือหลักฐานยืนยันความเป็นบ่าวที่แท้จริง"
      },
      {
        "ayat_range": "284-286",
        "theme": "อิบาดะฮฺต่ออัลลอฮฺเพียงผู้เดียวเท่านั้น"
      },
      {
        "ayat_range": "254-286",
        "theme": "รากฐานของการเป็นบ่าวของอัลลอฮฺ"
      }
    ],
    "content_detail": "สูเราะฮฺมะดะนิยยะฮฺ จำนวน 286 อายะฮฺ “อัลบะเกาะเราะฮฺ” (البَقَرَةُ) คือสูเราะฮฺที่ยาวที่สุดในอัลกุรอาน มีเป้าหมายเพื่อตระเตรียมประชาชาติอิสลามให้พร้อมทำหน้าที่ “เคาะลีฟะตุลลอฮฺ” (ตัวแทนของอัลลอฮฺ) ในการปกครองและดูแลบริหารโลกใบนี้ด้วยศาสนาของพระองค์ เนื้อหาของสูเราะฮฺมีการกล่าวถึงเรื่องราวมากมาย ทั้งหลักศรัทธา, การอิบาดะฮฺ, บทบัญญัติต่าง ๆ ตลอดจนเรื่องราวของกลุ่มชนในอดีต โดยเฉพาะที่เกี่ยวข้องกับบนีอิสรออีล สูเราะฮฺนี้ได้ชื่อว่า “อัลบะเกาะเราะฮฺ” หมายถึง “วัวตัวเมีย” เนื่องจากมีการกล่าวถึงเรื่องราวของวัวตัวเมียที่อัลลอฮฺได้บัญชาให้บนีอิสรออีลเชือดพลี ความพิเศษอย่างหนึ่งของสูเราะฮฺอัลบะเกาะเราะฮฺ คือ ช่วยขับไล่ชัยฏอนและป้องกันจากไสยศาสตร์ได้ โดยเฉพาะอายะฮฺกุรซีย์ (อายะฮฺที่ 255) ซึ่งท่านนบีส่งเสริมให้อ่านทุกครั้งหลังละหมาดฟัรดู รวมถึง 2 อายะฮฺสุดท้าย (คือ อายะฮฺที่ 285-286) ที่ส่งเสริมให้อ่านเป็นประจำทุกคืนก่อนเข้านอน"
  },
  {
    "surah_id": "3",
    "name": "Aal-EImran",
    "reveal": "มะดะนิยยะฮฺ",
    "max_ayat": 200,
    "thematic_ayat": [
      {
        "ayat_range": "1-7",
        "theme": "เดชานุภาพของอัลลอฮฺ"
      },
      {
        "ayat_range": "8-9",
        "theme": "ดุอาอ์ขอให้มีจิตใจที่มั่นคง"
      },
      {
        "ayat_range": "10-17",
        "theme": "บั้นปลายของผู้ปฏิเสธศรัทธาและผู้ศรัทธา"
      },
      {
        "ayat_range": "18-20",
        "theme": "เอกานุภาพของอัลลอฮฺ"
      },
      {
        "ayat_range": "21-25",
        "theme": "ชาวคัมภีร์กับการสังหารบรรดานบี"
      },
      {
        "ayat_range": "26-27",
        "theme": "อัลลอฮฺทรงเดชานุภาพเหนือทุกสิ่ง"
      },
      {
        "ayat_range": "28-30",
        "theme": "การเป็นมิตรกับผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "31-32",
        "theme": "ภาคผลของการรักอัลลอฮฺ"
      },
      {
        "ayat_range": "33-37",
        "theme": "เรื่องราวของมัรยัม"
      },
      {
        "ayat_range": "38-41",
        "theme": "เรื่องราวของนบีซะกะริยยา"
      },
      {
        "ayat_range": "42-48",
        "theme": "การกำเนิดของนบีอีซา"
      },
      {
        "ayat_range": "49-59",
        "theme": "เรื่องราวของนบีอีซา"
      },
      {
        "ayat_range": "33-59",
        "theme": "เรื่องราวของครอบครัวอิมรอน"
      },
      {
        "ayat_range": "60-64",
        "theme": "การท้าสาบานกับชาวคริสต์จากนัจรอน"
      },
      {
        "ayat_range": "65-85",
        "theme": "ตอบโต้ชาวคัมภีร์ และลักษณะของพวกเขา"
      },
      {
        "ayat_range": "86-91",
        "theme": "อัลลอฮฺไม่ทรงชี้แนะแก่ผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "60-91",
        "theme": "ชาวคัมภีร์"
      },
      {
        "ayat_range": "92-95",
        "theme": "การบริจาคสิ่งที่รัก และข้อกล่าวหาต่อนบียะอฺกูบ"
      },
      {
        "ayat_range": "96-97",
        "theme": "บัยตุลลอฮฺและการทำหัจญ์"
      },
      {
        "ayat_range": "98-111",
        "theme": "ตอบโต้ชาวคัมภีร์ และคำแนะนำต่อผู้ศรัทธา"
      },
      {
        "ayat_range": "112-120",
        "theme": "สภาพของชาวคัมภีร์ และการตอบแทนสำหรับผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "1-120",
        "theme": "การยืนหยัดต่อสู้กับแนวคิดที่เบี่ยงเบน"
      },
      {
        "ayat_range": "121-129",
        "theme": "สงครามบัดรุและอุหุด"
      },
      {
        "ayat_range": "130-141",
        "theme": "หน้าที่และบททดสอบของผู้ศรัทธา"
      },
      {
        "ayat_range": "142-158",
        "theme": "การญิฮาดคือบททดสอบเพื่อพิสูจน์ความศรัทธา"
      },
      {
        "ayat_range": "159-164",
        "theme": "คุณลักษณะของท่านเราะสูลุลลอฮฺ"
      },
      {
        "ayat_range": "165-174",
        "theme": "สาเหตุแห่งความพ่ายแพ้ในสมรภูมิอุหุด และสถานภาพของผู้ที่เสียชีวิตในการต่อสู้ (ชะฮีด)"
      },
      {
        "ayat_range": "175-179",
        "theme": "คำเตือนให้ระวังชัยฏอน (มารร้าย) และพลพรรคของมัน"
      },
      {
        "ayat_range": "180-184",
        "theme": "ความตระหนี่ของชาวยิว และบั้นปลายของพวกเขา"
      },
      {
        "ayat_range": "185-186",
        "theme": "ทุกชีวิตต้องลิ้มรสความตาย"
      },
      {
        "ayat_range": "187-188",
        "theme": "ลักษณะของชาวคัมภีร์"
      },
      {
        "ayat_range": "189-190",
        "theme": "เดชานุภาพของอัลลอฮฺ"
      },
      {
        "ayat_range": "191-195",
        "theme": "อุลุลอัลบาบ (ผู้มีสติปัญญาใคร่ครวญ) คือใคร?"
      },
      {
        "ayat_range": "196-200",
        "theme": "บั้นปลายของผู้ปฏิเสธศรัทธาและผลตอบแทนของผู้ยำเกรง"
      },
      {
        "ayat_range": "121-200",
        "theme": "การยืนหยัดจากภายใน"
      }
    ],
    "content_detail": "สูเราะฮฺมะดะนิยยะฮฺ จำนวน 200 อายะฮฺ “อาลุอิมรอน” (آلُ عِمْرَانَ) คือสูเราะฮฺที่มีเนื้อหาสำคัญ 2 เรื่อง คือ 1- หลักศรัทธาที่ถูกต้อง พร้อมกับหลักฐานและข้อพิสูจน์ที่ยืนยันถึงเอกานุภาพของอัลลอฮฺ (เตาฮีด) 2- บทบัญญัติต่าง ๆ โดยเฉพาะที่เกี่ยวข้องกับการต่อสู้ในหนทางของอัลลอฮฺ (ญิฮาด) ทั้งนี้เพื่อตอบโต้ข้อสงสัยต่าง ๆ ของชาวคัมภีร์ และทำให้ผู้ศรัทธาสามารถยืนหยัดมั่นคงในความศรัทธาและศาสนาอิสลามต่อไป ท่านเราะสูลุลลอฮฺ ศ็อลลัลลอฮุ อะลัยฮิ วะสัลลัม ได้กล่าวว่า \"...พวกท่านจงอ่านดอกไม้ทั้งสอง คือ (สูเราะฮฺ) 'อัลบะเกาะเราะฮฺ' และ 'อาลุอิมรอน' แท้จริงแล้วทั้งสองจะมาในวันกิยามะฮฺ เสมือนเมฆ 2 ก้อน หรือร่มเงา 2 ร่ม หรือฝูงนก 2 ฝูงที่เรียงแถวกัน เพื่อปกป้องสหายของพวกมัน...” (บันทึกโดยมุสลิม หะดีษเลขที่ 804)"
  },
  {
    "surah_id": "4",
    "name": "An-Nisa",
    "reveal": "มะดะนิยยะฮฺ",
    "max_ayat": 176,
    "thematic_ayat": [
      {
        "ayat_range": "1",
        "theme": "ต้นกำเนิดเดียวกันของมนุษย์"
      },
      {
        "ayat_range": "2-6",
        "theme": "เด็กกำพร้าและการมีภรรยาหลายคน"
      },
      {
        "ayat_range": "7-12",
        "theme": "มรดกและการกินทรัพย์สินของเด็กกำพร้า"
      },
      {
        "ayat_range": "1-12",
        "theme": "จงยุติธรรมและเมตตาต่อผู้อ่อนแอ"
      },
      {
        "ayat_range": "13-14",
        "theme": "ผลบุญแด่ผู้เชื่อฟัง และบทลงโทษสำหรับผู้ฝ่าฝืน"
      },
      {
        "ayat_range": "15-18",
        "theme": "บทลงโทษสำหรับผู้ที่ผิดประเวณี"
      },
      {
        "ayat_range": "13-18",
        "theme": "ภาคผลและการตอบแทน"
      },
      {
        "ayat_range": "19-25",
        "theme": "สิทธิของผู้หญิง และเรื่องมะหฺร็อม"
      },
      {
        "ayat_range": "26-28",
        "theme": "ความเมตตาของอัลลอฮฺ"
      },
      {
        "ayat_range": "29-30",
        "theme": "ห้ามละเมิดทรัพย์สินและชีวิตของมุสลิม"
      },
      {
        "ayat_range": "31-33",
        "theme": "จงหลีกห่างจากบาปใหญ่ และอย่าคาดหวังในสิ่งที่ไม่ใช่สิทธิ์ของตน"
      },
      {
        "ayat_range": "19-33",
        "theme": "สิทธิต่าง ๆ"
      },
      {
        "ayat_range": "34-36",
        "theme": "บทบัญญัติเกี่ยวกับครอบครัว"
      },
      {
        "ayat_range": "37-42",
        "theme": "เกี่ยวกับคนที่ตระหนี่และโอ้อวด"
      },
      {
        "ayat_range": "43",
        "theme": "การละหมาดและตะยัมมุม"
      },
      {
        "ayat_range": "44-57",
        "theme": "พฤติกรรมที่ถูกตำหนิของชาวคัมภีร์"
      },
      {
        "ayat_range": "58-59",
        "theme": "การรักษาอะมานะฮฺ และการตัดสินด้วยความยุติธรรม"
      },
      {
        "ayat_range": "34-59",
        "theme": "ความยุติธรรม"
      },
      {
        "ayat_range": "60-68",
        "theme": "ข้ออ้างของพวกมุนาฟิก"
      },
      {
        "ayat_range": "69-70",
        "theme": "สถานภาพและการตอบแทนสำหรับผู้ที่เชื่อฟัง"
      },
      {
        "ayat_range": "71-84",
        "theme": "หลักการญิฮาดและจุดยืนของพวกมุนาฟิก"
      },
      {
        "ayat_range": "85-87",
        "theme": "การช่วยเหลือคือสิ่งดีงาม"
      },
      {
        "ayat_range": "88-91",
        "theme": "การปฏิสัมพันธ์กับพวกมุนาฟิก"
      },
      {
        "ayat_range": "92-93",
        "theme": "การฆ่าที่ผิด"
      },
      {
        "ayat_range": "94-100",
        "theme": "เรียกร้องสู่การญิฮาดและความประเสริฐของผู้ที่ทำญิฮาด"
      },
      {
        "ayat_range": "101-104",
        "theme": "การละหมาดย่อและละหมาดเคาฟุ"
      },
      {
        "ayat_range": "60-104",
        "theme": "การต่อสู้เพื่อปกป้องสิทธิของผู้อ่อนแอ"
      },
      {
        "ayat_range": "105-113",
        "theme": "คำสั่งให้ยุติธรรม และการปฏิสัมพันธ์กับคนทรยศ"
      },
      {
        "ayat_range": "114-121",
        "theme": "อันตรายของการตั้งภาคีและชัยฏอน"
      },
      {
        "ayat_range": "122-126",
        "theme": "ผลตอบแทนสำหรับการงานที่ดี"
      },
      {
        "ayat_range": "127-130",
        "theme": "ผู้หญิงและครอบครัว"
      },
      {
        "ayat_range": "131-136",
        "theme": "ยืนยันในเอกานุภาพของอัลลอฮฺ และคำสั่งใช้ให้ยุติธรรม"
      },
      {
        "ayat_range": "105-136",
        "theme": "คำสั่งใช้ให้มีความยุติธรรม"
      },
      {
        "ayat_range": "137-149",
        "theme": "ลักษณะเฉพาะของพวกมุนาฟิก"
      },
      {
        "ayat_range": "150-152",
        "theme": "การงานของผู้ปฏิเสธศรัทธาและผู้ศรัทธา"
      },
      {
        "ayat_range": "153-162",
        "theme": "เกี่ยวกับชาวคัมภีร์"
      },
      {
        "ayat_range": "163-166",
        "theme": "เหตุผลของการส่งเราะสูล"
      },
      {
        "ayat_range": "167-175",
        "theme": "การตอบแทนสำหรับผู้ปฏิเสธศรัทธาและผู้ศรัทธา"
      },
      {
        "ayat_range": "176",
        "theme": "ส่วนแบ่งของพี่น้องในเรื่องมรดก"
      },
      {
        "ayat_range": "137-176",
        "theme": "สภาพของมนุษย์และการตอบแทน"
      }
    ],
    "content_detail": "สูเราะฮฺมะดะนิยยะฮฺ จำนวน 176 อายะฮฺ สูเราะฮฺนี้ถูกเรียกด้วยชื่อ “อันนิสาอ์” (النِّسَاءُ) หมายถึง “ผู้หญิง” เนื่องจากได้กล่าวถึงบทบัญญัติต่าง ๆ ที่เกี่ยวข้องกับผู้หญิง ทั้งเรื่องเด็กกำพร้า, การแต่งงาน, ค่ามะฮัรและการปกป้องดูแลผู้หญิง, การปรึกษาหารือกันในครอบครัว, สิทธิและหน้าที่ของสามีและภรรยา, การหย่าร้าง, มะหฺร็อม และการแบ่งมรดก เป็นต้น"
  },
  {
    "surah_id": "5",
    "name": "Al-Maidah",
    "reveal": "มะดะนิยยะฮฺ",
    "max_ayat": 120,
    "thematic_ayat": [
      {
        "ayat_range": "1-6",
        "theme": "การรักษาสัญญา เรื่องหะลาล-หะรอม และความสะอาด"
      },
      {
        "ayat_range": "7-11",
        "theme": "เตือนให้ระลึกถึงความโปรดปรานและมีความยุติธรรม"
      },
      {
        "ayat_range": "12-19",
        "theme": "เกี่ยวกับชาวคัมภีร์และเราะสูลของพวกเขา"
      },
      {
        "ayat_range": "20-26",
        "theme": "บนีอิสรออีลทอดทิ้งมูซา"
      },
      {
        "ayat_range": "27-31",
        "theme": "เรื่องราวของกอบีลและฮาบีล"
      },
      {
        "ayat_range": "32-34",
        "theme": "ผลตอบแทนของการฆ่าและการสร้างความเสียหายในแผ่นดิน"
      },
      {
        "ayat_range": "35",
        "theme": "ใกล้ชิดอัลลอฮฺด้วยการทำความดี"
      },
      {
        "ayat_range": "36-37",
        "theme": "บทลงโทษในโลกหน้าสำหรับผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "38-40",
        "theme": "บทลงโทษของการลักขโมย"
      },
      {
        "ayat_range": "1-40",
        "theme": "การปกป้องศาสนา, เกียรติยศ, ชีวิต และทรัพย์สิน"
      },
      {
        "ayat_range": "41-43",
        "theme": "ปลอบใจท่านนบี"
      },
      {
        "ayat_range": "44-50",
        "theme": "คัมภีร์จากฟากฟ้าและการตัดสินด้วยบทบัญญัติของอัลลอฮฺ"
      },
      {
        "ayat_range": "51-58",
        "theme": "ห้ามเป็นมิตรใกล้ชิดกับผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "59-76",
        "theme": "การตั้งภาคีต่ออัลลอฮฺของชาวคริสต์"
      },
      {
        "ayat_range": "77-86",
        "theme": "ยิวและผู้ตั้งภาคี คือศัตรูที่ร้ายกาจของผู้ศรัทธา"
      },
      {
        "ayat_range": "41-86",
        "theme": "ห้ามเป็นมิตรใกล้ชิดกับผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "87-88",
        "theme": "ไม่อนุญาตให้ห้ามในสิ่งที่อัลลอฮฺทรงอนุมัติ"
      },
      {
        "ayat_range": "89",
        "theme": "บทบัญญัติเกี่ยวกับการสาบาน"
      },
      {
        "ayat_range": "90-100",
        "theme": "สิ่งต้องห้ามต่าง ๆ"
      },
      {
        "ayat_range": "101-105",
        "theme": "ตอบโต้คนเขลาในยุคญาฮิลิยยะฮฺ"
      },
      {
        "ayat_range": "106-108",
        "theme": "พยานสำหรับการทำพินัยกรรม"
      },
      {
        "ayat_range": "87-108",
        "theme": "บทบัญญัติต่าง ๆ"
      },
      {
        "ayat_range": "109",
        "theme": "บรรดาเราะสูลจะถูกถามเกี่ยวกับกลุ่มชนของพวกเขา"
      },
      {
        "ayat_range": "110-115",
        "theme": "มุอฺญิซาตของนบีอีซา และเรื่องราวเกี่ยวกับสำรับอาหาร"
      },
      {
        "ayat_range": "116-119",
        "theme": "บทสนทนาระหว่างนบีอีซากับอัลลอฮฺ"
      },
      {
        "ayat_range": "120",
        "theme": "อัลลอฮฺทรงเดชานุภาพเหนือทุกสิ่ง"
      },
      {
        "ayat_range": "109-120",
        "theme": "การตอบแทนในโลกนี้ และเรื่องราวเกี่ยวกับสำรับอาหาร"
      }
    ],
    "content_detail": "สูเราะฮฺมะดะนิยยะฮฺ จำนวน 120 อายะฮฺ สูเราะฮฺนี้ถูกเรียกว่า \"อัลมาอิดะฮฺ” (المَائِدَةُ) หมายถึง “สำรับอาหาร” เนื่องจากมีการกล่าวถึงเรื่องราวเกี่ยวกับสำรับอาหารที่ถูกประทานให้กับบนีอิสรออีลในยุคของนบีอีซา อะลัยฮิสสะลาม"
  },
  {
    "surah_id": "6",
    "name": "Al-Anam",
    "reveal": "มักกิยยะฮฺ",
    "max_ayat": 165,
    "thematic_ayat": [
      {
        "ayat_range": "1-3",
        "theme": "เดชานุภาพของอัลลอฮฺ"
      },
      {
        "ayat_range": "4-11",
        "theme": "ความดื้อรั้นของผู้ตั้งภาคี"
      },
      {
        "ayat_range": "12-19",
        "theme": "การท้าทายของผู้ตั้งภาคี"
      },
      {
        "ayat_range": "20-32",
        "theme": "จุดยืนของผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "33-39",
        "theme": "ปลอบใจท่านนบี"
      },
      {
        "ayat_range": "40-47",
        "theme": "สนทนากับผู้ตั้งภาคีชาวกุร็อยช์"
      },
      {
        "ayat_range": "48-67",
        "theme": "คำแนะนำในการดะอฺวะฮฺแก่ท่านเราะสูลุลลอฮฺ"
      },
      {
        "ayat_range": "68-73",
        "theme": "ห้ามนั่งร่วมกับผู้เย้ยหยันศาสนา"
      },
      {
        "ayat_range": "74-83",
        "theme": "นบีอิบรอฮีมดะอฺวะฮฺคุณพ่อ"
      },
      {
        "ayat_range": "84-90",
        "theme": "ทางนำของอัลลอฮฺแก่บรรดานบี"
      },
      {
        "ayat_range": "1-90",
        "theme": "แนะนำมนุษย์ให้รู้จักพระเจ้า"
      },
      {
        "ayat_range": "91-94",
        "theme": "ตอบโต้การปฏิเสธสารของอัลลอฮฺ"
      },
      {
        "ayat_range": "95-105",
        "theme": "ความโปรดปรานของอัลลอฮฺ คือหลักฐานยืนยันเดชานุภาพของพระองค์"
      },
      {
        "ayat_range": "106-107",
        "theme": "จำเป็นต้องตามวะหฺยู"
      },
      {
        "ayat_range": "108",
        "theme": "ไม่อนุญาตให้ด่าทอผู้ตั้งภาคี จนเป็นเหตุให้อัลลอฮฺถูกก่นด่า"
      },
      {
        "ayat_range": "109-111",
        "theme": "ผู้ตั้งภาคีจะต่อต้านสัจธรรม"
      },
      {
        "ayat_range": "112-117",
        "theme": "คำแนะนำในการปฏิสัมพันธ์กับผู้ตั้งภาคี"
      },
      {
        "ayat_range": "118-121",
        "theme": "การเชือดสัตว์พลีเพื่ออัลลอฮฺ"
      },
      {
        "ayat_range": "122-127",
        "theme": "เปรียบเทียบผู้ศรัทธากับผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "128-131",
        "theme": "สภาพในโลกหน้าของผู้ที่ฝ่าฝืน"
      },
      {
        "ayat_range": "132-135",
        "theme": "สถานภาพของแต่ละคนในโลกหน้า"
      },
      {
        "ayat_range": "91-135",
        "theme": "ยืนยันในเอกานุภาพของอัลลอฮฺและการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "136-144",
        "theme": "ความหลงผิดแห่งญาฮิลิยยะฮฺ และความโปรดปรานของอัลลอฮฺ"
      },
      {
        "ayat_range": "145-153",
        "theme": "สิ่งที่อัลลอฮฺทรงห้าม"
      },
      {
        "ayat_range": "154-158",
        "theme": "จำเป็นต้องปฏิบัติตามทางนำจากคัมภีร์ของอัลลอฮฺ"
      },
      {
        "ayat_range": "159-165",
        "theme": "ระวังการแตกแยกในเรื่องศาสนา"
      },
      {
        "ayat_range": "136-165",
        "theme": "คำแนะนำแด่ท่านนบีและผู้ศรัทธา"
      }
    ],
    "content_detail": "สูเราะฮฺมักกิยยะฮฺ จำนวน 165 อายะฮฺ สูเราะฮฺนี้ได้ชื่อว่า “อัลอันอาม” (الأَنْعَามُ) หมายถึง “ปศุสัตว์” เนื่องจากมีการกล่าวถึงปศุสัตว์ในหลายกรณี เช่น เป็นสัตว์พลีที่ผู้ตั้งภาคีได้ถวายให้กับอัลลอฮฺและรูปเจว็ดของพวกเขา, ความเชื่อของชาวกุร็อยช์เกี่ยวกับสิ่งที่อยู่ในท้องของพวกปศุสัตว์ และประโยชน์ต่าง ๆ ของพวกมัน สูเราะฮฺอัลอันอามนั้นเป็นสูเราะฮฺมักกิยยะฮฺ ยกเว้นอายะฮฺที่ 20, 23, 91, 93, 114, 141 และ 151-153 ซึ่งถูกประทานลงมาในช่วงที่ท่านนบีอยู่ที่เมืองมะดีนะฮฺ อายะฮฺที่ 79 ของสูเราะฮฺอัลอันอาม มี “ดุอาอ์อิฟติตาหฺ” ที่ส่งเสริมให้อ่านหลังการตักบีรแรกของการละหมาด (ตักบีเราะตุล อิหฺรอม) ก่อนจะเริ่มอ่านสูเราะฮฺอัลฟาติหะฮฺ"
  },
  {
    "surah_id": "7",
    "name": "Al-Araf",
    "reveal": "มักกิยยะฮฺ",
    "max_ayat": 206,
    "thematic_ayat": [
      {
        "ayat_range": "1-9",
        "theme": "จำเป็นต้องปฏิบัติตามอัลกุรอาน"
      },
      {
        "ayat_range": "10-27",
        "theme": "เรื่องราวของนบีอาดัมกับอิบลีส"
      },
      {
        "ayat_range": "28-34",
        "theme": "ห้ามการถือตามอย่างมืดบอด และคำสั่งใช้ให้ยืนหยัดในบทบัญญัติของอัลลอฮฺ"
      },
      {
        "ayat_range": "35-45",
        "theme": "การส่งเราะสูล และบั้นปลายของผู้ปฏิเสธศรัทธาและผู้ศรัทธา"
      },
      {
        "ayat_range": "46-53",
        "theme": "ชาวอะอฺร็อฟ"
      },
      {
        "ayat_range": "54-58",
        "theme": "เดชานุภาพของอัลลอฮฺ"
      },
      {
        "ayat_range": "59-64",
        "theme": "นบีนูหฺ"
      },
      {
        "ayat_range": "65-72",
        "theme": "นบีฮูด"
      },
      {
        "ayat_range": "73-79",
        "theme": "นบีศอลิหฺ"
      },
      {
        "ayat_range": "80-84",
        "theme": "นบีลูฏ"
      },
      {
        "ayat_range": "85-93",
        "theme": "นบีชุอัยบฺ"
      },
      {
        "ayat_range": "94-102",
        "theme": "กฎเกณฑ์ของอัลลอฮฺต่อผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "59-102",
        "theme": "เรื่องราวของบรรดานบี"
      },
      {
        "ayat_range": "103-126",
        "theme": "บทสนทนากับฟิรเอานุ"
      },
      {
        "ayat_range": "127-129",
        "theme": "ฟิรเอานุไม่ยอมปล่อยนบีมูซาและบนีอิสรออีลไป"
      },
      {
        "ayat_range": "130-136",
        "theme": "ความพินาศของฟิรเอานุและพลพรรคของเขา"
      },
      {
        "ayat_range": "137-141",
        "theme": "ความเขลาของบนีอิสรออีล"
      },
      {
        "ayat_range": "142-145",
        "theme": "นบีมูซาเข้าเฝ้าอัลลอฮฺ"
      },
      {
        "ayat_range": "146-157",
        "theme": "บนีอิสรออีลกราบไหว้รูปปั้นลูกวัว"
      },
      {
        "ayat_range": "158-171",
        "theme": "ความเมตตาของอัลลอฮฺและการละเมิดฝ่าฝืนของบนีอิสรออีล"
      },
      {
        "ayat_range": "103-171",
        "theme": "เรื่องราวของนบีมูซา"
      },
      {
        "ayat_range": "172-179",
        "theme": "สัญญาของอัลลอฮฺต่อลูกหลานอาดัม"
      },
      {
        "ayat_range": "180-188",
        "theme": "ความจริงเกี่ยวกับอัลลอฮฺ ชีวิต วันกิยามะฮฺ และนบีมุฮัมหมัด"
      },
      {
        "ayat_range": "189-198",
        "theme": "พฤติกรรมของผู้ตั้งภาคี"
      },
      {
        "ayat_range": "199-206",
        "theme": "คุณลักษณะของผู้ศรัทธา"
      }
    ],
    "content_detail": "สูเราะฮฺมักกิยยะฮฺ จำนวน 206 อายะฮฺ สูเราะฮฺนี้ชื่อว่า “อัลอะอฺร็อฟ” (الأعْرَافُ) เนื่องจากในอายะฮฺที่ 46 มีการกล่าวถึงกลุ่มชนที่อยู่บนกำแพงสูงระหว่างสวนสวรรค์กับนรก ในวันอาคิเราะฮฺ โดยเรียกคนกลุ่มนี้ว่า “ชาวอะอฺร็อฟ” พวกเขามองเห็นชาวสวรรค์และชาวนรก และได้สนทนากับทั้ง 2 กลุ่มตามที่อายะฮฺได้บอกเล่าไว้"
  },
  {
    "surah_id": "8",
    "name": "Al-Anfal",
    "reveal": "มะดะนิยยะฮฺ",
    "max_ayat": 75,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "คุณลักษณะของผู้ศรัทธาและทรัพย์สิน"
      },
      {
        "ayat_range": "5-19",
        "theme": "เกี่ยวกับสงครามบัดรุ"
      },
      {
        "ayat_range": "20-29",
        "theme": "คำสั่งใช้ให้เชื่อฟังอัลลอฮฺและเราะสูล"
      },
      {
        "ayat_range": "30-40",
        "theme": "แผนการณ์ของศัตรูอิสลาม"
      },
      {
        "ayat_range": "41",
        "theme": "การแบ่งทรัพย์เชลย"
      },
      {
        "ayat_range": "42-47",
        "theme": "สงครามบัดรุและคำสั่งให้ยืนหยัด"
      },
      {
        "ayat_range": "48-49",
        "theme": "แผนการณ์ของชัยฏอนและพลพรรคของมัน"
      },
      {
        "ayat_range": "50-54",
        "theme": "บทลงโทษสำหรับผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "55-59",
        "theme": "ลักษณะของผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "60-66",
        "theme": "ปลุกใจให้ต่อสู้"
      },
      {
        "ayat_range": "67-71",
        "theme": "เชลยศึกและทรัพย์เชลย"
      },
      {
        "ayat_range": "72-75",
        "theme": "สายสัมพันธ์ที่เข้มแข็งของผู้ศรัทธา"
      }
    ],
    "content_detail": "สูเราะฮฺมะดะนิยยะฮฺ จำนวน 75 อายะฮฺ “อัลอันฟาล” (الأَنْفَالُ) หมายถึง “ทรัพย์เชลยจากสงคราม” เนื้อหาโดยรวมของสูเราะฮฺนี้กล่าวถึงสงครามบัดรุ และบทบัญญัติต่าง ๆ เกี่ยวกับการทำสงคราม เช่น เชลยศึกและทรัพย์เชลย ตามรายงานของท่านอิบนุอับบาส เราะฎิยัลลอฮุอันฮุ ระบุว่า : สูเราะฮฺอัลอันฟาลถูกประทานลงมาเนื่องจากเกิดสงครามบัดรุระหว่างผู้ศรัทธากับผู้ปฏิเสธศรัทธาชาวกุร็อยช์ ซึ่งเกิดขึ้นในปี ฮ.ศ.2 โดยเป็นสงครามที่มีความสำคัญมากในประวัติศาสตร์อิสลาม"
  },
  {
    "surah_id": "9",
    "name": "At-Tawbah",
    "reveal": "มะดะนิยยะฮฺ",
    "max_ayat": 129,
    "thematic_ayat": [
      {
        "ayat_range": "1-7",
        "theme": "ยกเลิกข้อผูกพันกับผู้ตั้งภาคี"
      },
      {
        "ayat_range": "8-15",
        "theme": "ลักษณะของผู้ตั้งภาคี"
      },
      {
        "ayat_range": "16-19",
        "theme": "และ อายะฮฺ 20-22: ปลุกใจเพื่อการญิฮาด และปกป้องดูแลมัสญิด, ความประเสริฐและผลตอบแทนสำหรับมุญาฮิดีน"
      },
      {
        "ayat_range": "23-24",
        "theme": "ห้ามเป็นมิตรใกล้ชิดกับผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "25-27",
        "theme": "ความช่วยเหลือจากอัลลอฮฺ ในสงครามหุนัยนุ"
      },
      {
        "ayat_range": "28-33",
        "theme": "ห้ามผู้ตั้งภาคีเข้ามัสญิดหะรอม"
      },
      {
        "ayat_range": "34-35",
        "theme": "บาทหลวงที่กินเงินทองของประชาชน"
      },
      {
        "ayat_range": "36-37",
        "theme": ", อายะฮฺ 38-41, และ อายะฮฺ 42-59: เดือนต้องห้าม, คำสั่งให้ทำการญิฮาด, เปิดโปงพวกมุนาฟิก"
      },
      {
        "ayat_range": "60",
        "theme": "ผู้มีสิทธิ์รับซะกาตทั้ง 8 กลุ่ม"
      },
      {
        "ayat_range": "61-72",
        "theme": "คุณลักษณะและการตอบแทน ของพวกมุนาฟิกและผู้ศรัทธา"
      },
      {
        "ayat_range": "73-103",
        "theme": "พวกมุนาฟิกและผู้ที่ได้รับการผ่อนปรน ในเรื่องการญิฮาด"
      },
      {
        "ayat_range": "104-112",
        "theme": "การบริจาค การเตาบะฮฺ และการค้าขาย ที่ได้กำไร"
      },
      {
        "ayat_range": "113-116",
        "theme": "ห้ามขออภัยโทษให้กับผู้ตั้งภาคี"
      },
      {
        "ayat_range": "117-119",
        "theme": "อัลลอฮฺทรงอภัยโทษให้กับชาวตะทู้ก"
      },
      {
        "ayat_range": "120-123",
        "theme": "ความประเสริฐของผู้ที่ปรารถนา การญิฮาดและเสียสละในหนทาง ของอัลลอฮฺ"
      },
      {
        "ayat_range": "124-127",
        "theme": "จุดยืนของผู้ศรัทธาและพวกมุนาฟิก"
      },
      {
        "ayat_range": "128-129",
        "theme": "คุณลักษณะของท่านเราะสูลุลลอฮฺ"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "10",
    "name": "Yunus",
    "reveal": "มักกิยยะฮฺ",
    "max_ayat": 109,
    "thematic_ayat": [
      {
        "ayat_range": "1-2",
        "theme": "จุดยืนของผู้ตั้งภาคีต่ออัลกุรอาน"
      },
      {
        "ayat_range": "3-6",
        "theme": "หลักฐานความยิ่งใหญ่ของอัลลอฮฺ"
      },
      {
        "ayat_range": "7-10",
        "theme": "ผู้ที่ปฏิเสธโลกหน้าและผู้ศรัทธา"
      },
      {
        "ayat_range": "11-14",
        "theme": "พฤติกรรมมนุษย์ และกฎเกณฑ์ของอัลลอฮฺ"
      },
      {
        "ayat_range": "15-20",
        "theme": "ตอบโต้ผู้ตั้งภาคี"
      },
      {
        "ayat_range": "21-24",
        "theme": "มนุษย์ในช่วงสุขสบายและลำบาก"
      },
      {
        "ayat_range": "25-30",
        "theme": "ทางนำและการตอบแทน"
      },
      {
        "ayat_range": "31-44",
        "theme": "อัลกุรอานท้าทายผู้ตั้งภาคี"
      },
      {
        "ayat_range": "45-56",
        "theme": "สภาพของผู้ตั้งภาคีในโลกหน้า"
      },
      {
        "ayat_range": "57-60",
        "theme": "คำตักเตือนได้มาถึงแล้ว"
      },
      {
        "ayat_range": "61-64",
        "theme": "ความรู้ของอัลลอฮฺ ครอบคลุมทุกสิ่งทุกอย่าง"
      },
      {
        "ayat_range": "65-70",
        "theme": "ตอบโต้คำกล่าวอ้างของผู้ตั้งภาคี"
      },
      {
        "ayat_range": "71-74",
        "theme": "เรื่องราวของนบีนูหฺ และเราะสูลหลังจากท่าน"
      },
      {
        "ayat_range": "75-93",
        "theme": "เรื่องราวของนบีมูซาและฟิรเอานุ"
      },
      {
        "ayat_range": "94-97",
        "theme": "อัลกุรอานท้าทายผู้ที่ต่อต้าน"
      },
      {
        "ayat_range": "98",
        "theme": "เรื่องราวของนบียูนุส"
      },
      {
        "ayat_range": "99-103",
        "theme": "& 104-109: พระประสงค์ของอัลลอฮฺ, ยืนยันในเอกานุภาพของอัลลอฮฺ และ คำเรียกร้องให้ปฏิบัติตามสัจธรรม จากพระองค์"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "11",
    "name": "Hud",
    "reveal": "มักกิยยะฮฺ",
    "max_ayat": 123,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "อัลกุรอานและคำเรียกร้องไปสู่อัลลอฮฺ"
      },
      {
        "ayat_range": "5-8",
        "theme": "ความรู้ของอัลลอฮฺ และผู้ปฏิเสธศรัทธา ไม่เชื่อเรื่องการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "9-11",
        "theme": "สภาพของมนุษย์เมื่อถูกทดสอบ"
      },
      {
        "ayat_range": "12",
        "theme": "ปลอบใจท่านเราะสูลุลลอฮฺ"
      },
      {
        "ayat_range": "13-14",
        "theme": "การท้าทายจากอัลกุรอาน"
      },
      {
        "ayat_range": "15-24",
        "theme": "ผู้ศรัทธากับผู้ปฏิเสธศรัทธา ย่อมไม่เหมือนกัน"
      },
      {
        "ayat_range": "25-49",
        "theme": "เรื่องราวของนบีนูหฺ"
      },
      {
        "ayat_range": "50-60",
        "theme": "เรื่องราวของนบีฮูด"
      },
      {
        "ayat_range": "61-68",
        "theme": "เรื่องราวของนบีศอลิหฺ"
      },
      {
        "ayat_range": "69-76",
        "theme": "เรื่องราวของนบีอิบรอฮีม"
      },
      {
        "ayat_range": "77-83",
        "theme": "เรื่องราวของ นบีลูฏ"
      },
      {
        "ayat_range": "84-95",
        "theme": "เรื่องราวของนบีชุอัยบ์"
      },
      {
        "ayat_range": "96-99",
        "theme": "เรื่องราวของนบีมูซา"
      },
      {
        "ayat_range": "25-99",
        "theme": "เรื่องราวของบรรดานบี"
      },
      {
        "ayat_range": "100-102",
        "theme": "อัลลอฮฺทรงทำลายประชาชาติที่อธรรม"
      },
      {
        "ayat_range": "103-109",
        "theme": "สภาพบางส่วนของโลกหน้า"
      },
      {
        "ayat_range": "110-115",
        "theme": "ลักษณะของผู้ปฏิเสธศรัทธา และคำสั่งใช้แด่นบีและผู้ศรัทธา"
      },
      {
        "ayat_range": "116-119",
        "theme": "ห้ามสร้างความเสียหาย"
      },
      {
        "ayat_range": "120-123",
        "theme": "คำแนะนำแด่ท่านนบี"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "12",
    "name": "Yusuf",
    "reveal": "มักกิยยะฮฺ",
    "max_ayat": 111,
    "thematic_ayat": [
      {
        "ayat_range": "1-3",
        "theme": "คุณลักษณะของอัลกุรอาน"
      },
      {
        "ayat_range": "4-6",
        "theme": "ความฝันของนบียูสุฟ"
      },
      {
        "ayat_range": "7-20",
        "theme": "การรังแกจากพี่น้อง"
      },
      {
        "ayat_range": "21-35",
        "theme": "ฟิตนะฮฺจากภรรยาของกษัตริย์อียิปต์"
      },
      {
        "ayat_range": "36-53",
        "theme": "เพื่อนร่วมคุกและฝันของกษัตริย์"
      },
      {
        "ayat_range": "54-82",
        "theme": "นบียูสุฟในฐานะผู้ดูแลคลังของแผ่นดิน"
      },
      {
        "ayat_range": "83-101",
        "theme": "ครอบครัวของนบียูสุฟ ได้กลับมาอยู่พร้อมหน้ากันอีกครั้ง"
      },
      {
        "ayat_range": "102-104",
        "theme": "เรื่องราวของนบียูสุฟ คือหลักฐาน ยืนยันการเป็นนบีของนบีมุฮัมหมัด"
      },
      {
        "ayat_range": "105-110",
        "theme": "การผินหลังของพวกตั้งภาคี"
      },
      {
        "ayat_range": "111",
        "theme": "หิกมะฮฺของเรื่องเล่าในอัลกุรอาน"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "13",
    "name": "Ar-Rad",
    "reveal": "มะดะนิยยะฮฺ",
    "max_ayat": 43,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "สัจธรรมของอัลกุรอาน และเดชานุภาพของอัลลอฮฺ"
      },
      {
        "ayat_range": "5-7",
        "theme": "ผู้ตั้งภาคีปฏิเสธการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "8-16",
        "theme": "ความรู้และเดชานุภาพของอัลลอฮฺ"
      },
      {
        "ayat_range": "17",
        "theme": "อุปมาอุปไมยของ สัจธรรมและความเท็จ"
      },
      {
        "ayat_range": "18-25",
        "theme": "คุณลักษณะและบั้นปลายของ ผู้ศรัทธาและผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "26-29",
        "theme": "ริซกีและทางนำมาจากอัลลอฮฺ"
      },
      {
        "ayat_range": "30",
        "theme": "เราะสูลถูกส่งมาเพื่อเผยแพร่วะหฺยู"
      },
      {
        "ayat_range": "31-34",
        "theme": "ตอบโต้ผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "35-37",
        "theme": "สวรรค์และบั้นปลายของผู้ศรัทธา"
      },
      {
        "ayat_range": "38-39",
        "theme": "ความจริงเกี่ยวกับบรรดาเราะสูล"
      },
      {
        "ayat_range": "40-43",
        "theme": "เสริมพลังใจให้กับท่านเราะสูลุลลอฮฺ"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "14",
    "name": "Ibrahim",
    "reveal": "มักกิยยะฮฺ",
    "max_ayat": 52,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "เหตุผลของการประทานอัลกุรอาน และส่งเราะสูล"
      },
      {
        "ayat_range": "5-8",
        "theme": "เรื่องราวของนบีมูซา"
      },
      {
        "ayat_range": "9-17",
        "theme": "เรื่องราวของประชาชาติก่อนหน้า"
      },
      {
        "ayat_range": "18",
        "theme": "อุปมาการงานของผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "19-20",
        "theme": "อัลลอฮฺทรงสร้าง และเดชานุภาพเหนือทุกสิ่ง"
      },
      {
        "ayat_range": "21",
        "theme": "บทสนทนาของชาวนรก"
      },
      {
        "ayat_range": "22",
        "theme": "ชัยฏอนประกาศตัดข้อผูกพัน กับผู้ที่ตามมัน"
      },
      {
        "ayat_range": "23",
        "theme": "ผู้ศรัทธาได้เข้าสวนสวรรค์"
      },
      {
        "ayat_range": "24-27",
        "theme": "อุปมาคำพูดที่ดีกับคำพูดที่ไม่ดี"
      },
      {
        "ayat_range": "28-30",
        "theme": "บั้นปลายของผู้ที่เนรคุณ ต่อความโปรดปรานของอัลลอฮฺ"
      },
      {
        "ayat_range": "31",
        "theme": "คำแนะนำสำหรับผู้ศรัทธา"
      },
      {
        "ayat_range": "32-34",
        "theme": "เดชานุภาพและความโปรดปราน ของอัลลอฮฺ"
      },
      {
        "ayat_range": "35-41",
        "theme": "คำวิงวอนของนบีอิบรอฮีม"
      },
      {
        "ayat_range": "42-52",
        "theme": "คำเตือนต่อผู้อธรรม เรื่องสภาพในโลกหน้าของพวกเขา"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "15",
    "name": "Al-Hijr",
    "reveal": "มักกิยยะฮฺ",
    "max_ayat": 99,
    "thematic_ayat": [
      {
        "ayat_range": "1-9",
        "theme": "จุดยืนของผู้ปฏิเสธศรัทธา ต่อคัมภีร์อัลกุรอาน"
      },
      {
        "ayat_range": "10-15",
        "theme": "ประชาชาติต่าง ๆ ปฏิเสธศรัทธา ต่อเราะสูลของพวกเขา"
      },
      {
        "ayat_range": "16-25",
        "theme": "เดชานุภาพของอัลลอฮฺ"
      },
      {
        "ayat_range": "26-44",
        "theme": "เรื่องราวของการสร้างมนุษย์ การฝ่าฝืนของอิบลีส และบั้นปลาย ของมันกับผู้ที่ติดตาม"
      },
      {
        "ayat_range": "45-50",
        "theme": "การตอบแทนสำหรับผู้ยำเกรง"
      },
      {
        "ayat_range": "51-60",
        "theme": "เรื่องราวของนบีอิบรอฮีม กับแขกผู้แจ้งข่าว"
      },
      {
        "ayat_range": "61-77",
        "theme": "เรื่องราวของนบีลูฏ"
      },
      {
        "ayat_range": "78-84",
        "theme": "เรื่องราวของชาวอัยกะฮฺและชาวหิจญ์รุ"
      },
      {
        "ayat_range": "85-86",
        "theme": "วันสิ้นโลกเกิดขึ้นแน่นอน"
      },
      {
        "ayat_range": "87-99",
        "theme": "คำแนะนำและข่าวดีแด่ท่านนบี"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "16",
    "name": "An-Nahl-1",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 128,
    "thematic_ayat": [
      {
        "ayat_range": "1-21",
        "theme": "เอกานุภาพและเดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "22-29",
        "theme": "ผลตอบแทนของผู้ที่หยิ่งยโส"
      },
      {
        "ayat_range": "30-34",
        "theme": "ผลตอบแทนของผู้ยำเกรง"
      },
      {
        "ayat_range": "35-40",
        "theme": "ความหลงผิดของผู้ตั้งภาคี"
      },
      {
        "ayat_range": "41-42",
        "theme": "ผลตอบแทนของผู้อพยพ"
      },
      {
        "ayat_range": "43-44",
        "theme": "ความจริงและความสำคัญของเราะสูล"
      },
      {
        "ayat_range": "45-48",
        "theme": "ข่มขู่ผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "49-50",
        "theme": "ทุกสิ่งสุญูดต่ออัลลอฮ์"
      },
      {
        "ayat_range": "51-55",
        "theme": "การเชิญชวนไปสู่เตาฮีดและเตือนให้ระวังจากชิรก์"
      },
      {
        "ayat_range": "56-64",
        "theme": "ตอบโต้ความเขลาของผู้ตั้งภาคี"
      },
      {
        "ayat_range": "65-83",
        "theme": "ความโปรดปรานที่มากมายของอัลลอฮ์และการปฏิเสธของผู้ตั้งภาคี"
      },
      {
        "ayat_range": "84-89",
        "theme": "ช่วงหนึ่งของเหตุการณ์ในโลกหน้า"
      },
      {
        "ayat_range": "90-97",
        "theme": "คำแนะนำแก่ผู้ศรัทธาและชีวิตที่ดีสำหรับพวกเขา"
      },
      {
        "ayat_range": "98-105",
        "theme": "อัลกุรอานและคำตอบโต้ต่อผู้ที่ใส่ร้าย"
      },
      {
        "ayat_range": "106-111",
        "theme": "ลักษณะและผลตอบแทนแก่ผู้ทิ้งศาสนาและผู้ศรัทธา"
      },
      {
        "ayat_range": "112-113",
        "theme": "บั้นปลายของผู้ปฏิเสธความโปรดปราน"
      },
      {
        "ayat_range": "114-119",
        "theme": "การอนุมัติและสั่งห้ามเป็นสิทธิ์ของอัลลอฮ์"
      },
      {
        "ayat_range": "120-123",
        "theme": "นบีอิบรอฮีมและศาสนาที่เที่ยงตรง"
      },
      {
        "ayat_range": "124-128",
        "theme": "แนวทางการดะอฺวะฮฺไปสู่พระผู้เป็นเจ้า"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "17",
    "name": "Al-Israa",
    "reveal": "มักกิยยะฮฺ",
    "max_ayat": 111,
    "thematic_ayat": [
      {
        "ayat_range": "1",
        "theme": "เหตุการณ์อิสรอ ของท่านนบี"
      },
      {
        "ayat_range": "2-8",
        "theme": "เกี่ยวกับบนีอิสรออีล"
      },
      {
        "ayat_range": "9-11",
        "theme": "อัลกุรอานและผู้ที่ปฏิเสธศรัทธาต่อโลกหน้า"
      },
      {
        "ayat_range": "12-22",
        "theme": "สัญญาณของอัลลอฮฺในธรรมชาติ"
      },
      {
        "ayat_range": "23-25",
        "theme": "ยืนยันในเอกานุภาพของอัลลอฮฺ และการทำดีต่อพ่อแม่"
      },
      {
        "ayat_range": "26-40",
        "theme": "พฤติกรรมและมารยาทที่ดีในความสัมพันธ์ต่าง ๆ"
      },
      {
        "ayat_range": "41-60",
        "theme": "ตอบโต้ผู้ตั้งภาคี"
      },
      {
        "ayat_range": "61-65",
        "theme": "อิบลีสไม่ยอมสุญูด (แสดงความเคารพต่อนบีอาดัม)"
      },
      {
        "ayat_range": "66-70",
        "theme": "ความโปรดปรานต่าง ๆ ของอัลลอฮฺ"
      },
      {
        "ayat_range": "71-72",
        "theme": "มนุษย์ต้องรับผิดชอบต่อการกระทำของตนเอง"
      },
      {
        "ayat_range": "73-89",
        "theme": "คำแนะนำของอัลลอฮฺแด่ท่านนบี"
      },
      {
        "ayat_range": "90-100",
        "theme": "ความดื้อรั้นของผู้ตั้งภาคี และตอบโต้ข้อสงสัยของพวกเขา"
      },
      {
        "ayat_range": "101-104",
        "theme": "บทสนทนาระหว่างนบีมูซากับฟิรเอานุ"
      },
      {
        "ayat_range": "105-109",
        "theme": "การประทานอัลกุรอานโดยแยกส่วนและเป็นขั้นตอน"
      },
      {
        "ayat_range": "110-111",
        "theme": "ขอดุอาอ์ต่ออัลลอฮฺด้วยพระนามของพระองค์"
      }
    ],
    "content_detail": "สูเราะฮฺมักกิยยะฮฺ จำนวน 111 อายะฮฺ ความหมายของชื่อสูเราะฮฺ: “อัลอิสรออ์” (الإِسْرَاءُ) หมายถึง “การเดินทางในช่วงกลางคืน” เป็นการพูดถึงเหตุการณ์การเดินทางของท่านนบีมุฮัมหมัด จากมัสญิดอัลหะรอมไปยังมัสญิดอัลอักศอ (เรียกว่า “อิสรออ์”) และจากมัสญิดอัลอักศอไปยังชั้นฟ้าที่ 7 และชิดเราะตุลมุนตะฮา (เรียกว่า “มิอฺร็อจญ์”) เพื่อรับบัญญัติการละหมาด 5 เวลา ชื่อเรียกอื่น: สูเราะฮฺนี้ยังมีชื่อว่าสูเราะฮฺ “บนีอิสรออีล” (بَنِي إِسْرَائِيلُ) เนื่องจากมีการกล่าวถึงพวกเขาทั้งในช่วงต้นและช่วงท้ายของสูเราะฮฺ คืออายะฮฺที่ 2-8 และอายะฮฺที่ 101-104"
  },
  {
    "surah_id": "18",
    "name": "Al-Kahfi",
    "reveal": "มักกิยยะฮฺ",
    "max_ayat": 110,
    "thematic_ayat": [
      {
        "ayat_range": "1-8",
        "theme": "สรรเสริญต่ออัลลอฮฺ และแจ้งข่าวดีพร้อมกับตักเตือน"
      },
      {
        "ayat_range": "9-27",
        "theme": "เรื่องราวของชาวถ้ำ"
      },
      {
        "ayat_range": "28-31",
        "theme": "ย้ำเตือนให้ท่านนบีอดทน"
      },
      {
        "ayat_range": "32-44",
        "theme": "เรื่องราวของเจ้าของสวน 2 สวน"
      },
      {
        "ayat_range": "45-46",
        "theme": "ความดีงามที่ยั่งยืน"
      },
      {
        "ayat_range": "47-49",
        "theme": "สภาพของโลกหน้า"
      },
      {
        "ayat_range": "50-59",
        "theme": "กฎเกณฑ์ของอัลลอฮฺในการจัดการกับผู้อธรรม"
      },
      {
        "ayat_range": "60-82",
        "theme": "เรื่องราวของนบีมูซาและเคาะฎิร"
      },
      {
        "ayat_range": "83-99",
        "theme": "เรื่องราวของซุลก็อรนัยน์"
      },
      {
        "ayat_range": "100-110",
        "theme": "สภาพของผู้ปฏิเสธศรัทธาและผู้ศรัทธา และการยืนยันในวะหฺยูของท่านนบี"
      }
    ],
    "content_detail": "สูเราะฮฺมักกิยยะฮฺ จำนวน 110 อายะฮฺ ความหมายและความสำคัญ: สูเราะฮฺ “อัลกะฮฟ์” (الكَهْفُ) หมายถึง “ถ้ำ” ถือเป็นหนึ่งในสูเราะฮฺที่มีความสำคัญเป็นพิเศษ มีหะดีษหลายบทที่ส่งเสริมให้อ่าน ท่องจำ และศึกษาเนื้อหาของสูเราะฮฺนี้ คุณค่าการท่องจำ: ท่านนบี ศ็อลลัลลอฮุ อะลัยฮิ วะสัลลัม ได้กล่าวว่า “ใครที่ท่องจำ 10 อายะฮฺแรกของสูเราะฮฺอัลกะฮฟ์ เขาจะได้รับการคุ้มครองจากดัจญาล” (บันทึกโดยมุสลิม หะดีษเลขที่ 809) 4 เรื่องราวเด่นในสูเราะฮฺ:"
  },
  {
    "surah_id": "19",
    "name": "Maryam",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 98,
    "thematic_ayat": [
      {
        "ayat_range": "1-58",
        "theme": "เรื่องราวของบรรดานบี"
      },
      {
        "ayat_range": "1-15",
        "theme": "เรื่องราวของนบีซะกะรียาและข่าวดีเกี่ยวกับยะห์ยา"
      },
      {
        "ayat_range": "16-40",
        "theme": "เรื่องราวของมัรยัมและการตั้งครรภ์นบีอีซา"
      },
      {
        "ayat_range": "41-50",
        "theme": "เรื่องราวของนบีอิบรอฮีม"
      },
      {
        "ayat_range": "51-53",
        "theme": "เรื่องราวของนบีมูซาและฮารูน"
      },
      {
        "ayat_range": "54-55",
        "theme": "เรื่องราวของนบีอิสมาอีล"
      },
      {
        "ayat_range": "56-58",
        "theme": "เรื่องราวของนบีอิดรีสและคุณลักษณะของบรรดานบี"
      },
      {
        "ayat_range": "59-65",
        "theme": "สภาพของประชาชาติภายหลังบรรดานบีของพวกเขา"
      },
      {
        "ayat_range": "66-76",
        "theme": "ลักษณะและผลตอบแทนของผู้ปฏิเสธการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "77-87",
        "theme": "ความยะโสและดื้อรั้นของผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "88-95",
        "theme": "อัลลอฮ์ไม่มีลูกและภาคีใด ๆ"
      },
      {
        "ayat_range": "96-98",
        "theme": "ผลตอบแทนของผู้ศรัทธาและจุดจบของผู้ปฏิเสธ"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "20",
    "name": "Taha",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 135,
    "thematic_ayat": [
      {
        "ayat_range": "1-8",
        "theme": "อัลกุรอานและคุณลักษณะของอัลลอฮ์"
      },
      {
        "ayat_range": "9-99",
        "theme": "เรื่องราวของนบีมูซา"
      },
      {
        "ayat_range": "9-16",
        "theme": "อัลลอฮ์ทรงตรัสกับนบีมูซา"
      },
      {
        "ayat_range": "17-36",
        "theme": "มุอฺญิซาตของนบีมูซาและการตอบรับดุอาอ์ของท่าน"
      },
      {
        "ayat_range": "37-41",
        "theme": "ความโปรดปรานที่นบีมูซาได้รับก่อนเป็นนบี"
      },
      {
        "ayat_range": "42-48",
        "theme": "ภารกิจการดะอฺวะฮฺฟิรเอาน์"
      },
      {
        "ayat_range": "49-55",
        "theme": "บทสนทนาระหว่างนบีมูซากับฟิรเอาน์"
      },
      {
        "ayat_range": "56-76",
        "theme": "การเผชิญหน้าระหว่างนบีมูซากับนักมายากลของฟิรเอาน์"
      },
      {
        "ayat_range": "77-82",
        "theme": "ฟิรเอาน์และกองทัพของเขาจมน้ำตาย"
      },
      {
        "ayat_range": "83-99",
        "theme": "สามิรีย์ทำให้บนีอิสรออีลหลงผิด"
      },
      {
        "ayat_range": "100-113",
        "theme": "ผลตอบแทนแก่ผู้ที่ผินหลังและสภาพของโลกหน้า"
      },
      {
        "ayat_range": "114",
        "theme": "คำแนะนำมิให้ท่านนบีรีบเร่งอ่านอัลกุรอาน"
      },
      {
        "ayat_range": "115-127",
        "theme": "เรื่องราวที่มลาอิกะฮ์สุญูดให้แก่นบีอาดัม"
      },
      {
        "ayat_range": "128-135",
        "theme": "บทเรียนจากประชาชาติก่อนหน้าและคำแนะนำแก่ท่านนบี"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "21",
    "name": "Al-Ambiya",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 112,
    "thematic_ayat": [
      {
        "ayat_range": "1-10",
        "theme": "การสอบสวน, ความเผลอเรอความมนุษย์ และการปฏิเสธของผู้อธรรม"
      },
      {
        "ayat_range": "11-15",
        "theme": "การลงโทษบนดุนยาต่อประชาชาติที่อธรรม"
      },
      {
        "ayat_range": "16-20",
        "theme": "วิทยปัญญาของอัลลอฮ์ในการสร้างชั้นฟ้าและแผ่นดิน"
      },
      {
        "ayat_range": "21-33",
        "theme": "หลักฐานยืนยันในเดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "34-47",
        "theme": "จุดยืนของผู้ตั้งภาคิต่อท่านเราะสูล"
      },
      {
        "ayat_range": "48-91",
        "theme": "บทบาทของบรรดานบี"
      },
      {
        "ayat_range": "48-50",
        "theme": "เรื่องราวของนบีมูซาและฮารูน"
      },
      {
        "ayat_range": "51-73",
        "theme": "เรื่องราวของนบีอิบรอฮีมกับกลุ่มชนของท่าน"
      },
      {
        "ayat_range": "74-75",
        "theme": "เรื่องราวของนบีลูฏกับกลุ่มชนของท่าน"
      },
      {
        "ayat_range": "76-77",
        "theme": "เรื่องราวของนบีนูห์กับกลุ่มชนของท่าน"
      },
      {
        "ayat_range": "78-82",
        "theme": "เรื่องราวของนบีดาวูดและสุลัยมาน"
      },
      {
        "ayat_range": "83-84",
        "theme": "เรื่องราวของนบีอัยยูบ"
      },
      {
        "ayat_range": "85-86",
        "theme": "พูดถึงนบีอิสมาอีล อิดรีส และซุลกิฟลี"
      },
      {
        "ayat_range": "87-88",
        "theme": "เรื่องราวของนบียูนุส"
      },
      {
        "ayat_range": "89-90",
        "theme": "เรื่องราวของนบีซะกะรียา"
      },
      {
        "ayat_range": "91",
        "theme": "เรื่องราวของนบีอีซาและท่านหญิงมัรยัม"
      },
      {
        "ayat_range": "92-95",
        "theme": "บรรดานบีเรียกร้องไปสู่ศาสนาเดียวกัน"
      },
      {
        "ayat_range": "96-100",
        "theme": "ยะอฺญูจญ์-มะอฺญูจญ์ และการใกล้เข้ามาของวันสิ้นโลก"
      },
      {
        "ayat_range": "101-106",
        "theme": "ผู้ศรัทธาจะประสบความสำเร็จและรอดพ้นจากนรก"
      },
      {
        "ayat_range": "107-112",
        "theme": "ท่านนบีมุฮัมมัดคือความเมตตาแห่งสากลโลก"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "22",
    "name": "Al-Hajj",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 78,
    "thematic_ayat": [
      {
        "ayat_range": "1-37",
        "theme": "เตือนสำทับเรื่องการฟื้นคืนชีพในวันกิยามะฮ์"
      },
      {
        "ayat_range": "1-7",
        "theme": "สภาพของวันกิยามะฮ์"
      },
      {
        "ayat_range": "8-16",
        "theme": "การโต้เถียงของผู้ตั้งภาคีและการอิบาดะฮ์ของมุนาฟิก"
      },
      {
        "ayat_range": "17-18",
        "theme": "อัลลอฮ์ทรงตัดสินระหว่างปวงบ่าว"
      },
      {
        "ayat_range": "19-24",
        "theme": "ผลตอบแทนของผู้ปฏิเสธและผู้ศรัทธา"
      },
      {
        "ayat_range": "25-29",
        "theme": "ผู้ตั้งภาคีขัดขวางจากมัสยิดหะรอมและการทำฮัจญ์"
      },
      {
        "ayat_range": "38-60",
        "theme": "การญิฮาด"
      },
      {
        "ayat_range": "38-41",
        "theme": "อัลลอฮ์ทรงปกป้องและช่วยเหลือผู้ศรัทธา"
      },
      {
        "ayat_range": "42-48",
        "theme": "ประชาชาติรุ่นก่อนพินาศเพราะปฏิเสธเราะสูล"
      },
      {
        "ayat_range": "49-51",
        "theme": "ท่านเราะสูลคือผู้ตักเตือน"
      },
      {
        "ayat_range": "52-59",
        "theme": "จุดยืนของชัยฏอนต่อบรรดานบี"
      },
      {
        "ayat_range": "58-60",
        "theme": "ผลตอบแทนของผู้อพยพในหนทางของ อัลลอฮ์"
      },
      {
        "ayat_range": "61-78",
        "theme": "การอิบาดะฮ์ต่ออัลลอฮ์ด้วยความบริสุทธิ์"
      },
      {
        "ayat_range": "61-66",
        "theme": "เดชานุภาพของอัลลอฮ์และความโปรดปรานของพระองค์"
      },
      {
        "ayat_range": "67-72",
        "theme": "คำแนะนำของอัลลอฮ์ในการเผชิญหน้ากับผู้ตั้งภาคี"
      },
      {
        "ayat_range": "73-76",
        "theme": "อุทาหรณ์เกี่ยวกับผู้ที่กราบไหว้รูปเจว็ด"
      },
      {
        "ayat_range": "77-78",
        "theme": "คำแนะนำแก่ผู้ศรัทธา"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "23",
    "name": "Al-Muminun",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 118,
    "thematic_ayat": [
      {
        "ayat_range": "1-11",
        "theme": "คุณลักษณะของผู้ศรัทธาที่ประสบความสำเร็จ"
      },
      {
        "ayat_range": "12-16",
        "theme": "ลำดับการสร้างมนุษย์และยืนยันเรื่องการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "17-22",
        "theme": "การสร้างของอัลลอฮ์นั้นมหัศจรรย์ และความโปรดปรานของพระองค์ก็มากมาย"
      },
      {
        "ayat_range": "23-56",
        "theme": "การดะอฺวะฮฺของบรรดานบี"
      },
      {
        "ayat_range": "23-30",
        "theme": "เรื่องราวของนบีนูห์"
      },
      {
        "ayat_range": "31-44",
        "theme": "เรื่องราวของนบีฮูด"
      },
      {
        "ayat_range": "45-50",
        "theme": "เรื่องของนบีมูซาและฮารูน"
      },
      {
        "ayat_range": "51-56",
        "theme": "คำแนะนำแก่บรรดาเราะสูลและความขัดแย้งของมนุษย์"
      },
      {
        "ayat_range": "57-61",
        "theme": "ความยำเกรงและการรู้สึกใกล้ชิดกับอัลลอฮ์"
      },
      {
        "ayat_range": "62-77",
        "theme": "ลักษณะ การงาน และบั้นปลายของผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "78-92",
        "theme": "ย้ำเตือนถึงความโปรดปรานของอัลลอฮ์ และการปฏิเสธของผู้ตั้งภาคี"
      },
      {
        "ayat_range": "93-98",
        "theme": "คำแนะนำแก่นบีมุฮัมมัด"
      },
      {
        "ayat_range": "99-114",
        "theme": "ความเสียใจของผู้ฝ่าฝืนและเหตุการณ์ในวันกิยามะฮ์"
      },
      {
        "ayat_range": "115-118",
        "theme": "เป้าหมายของชีวิตมนุษย์"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "24",
    "name": "Annur",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 64,
    "thematic_ayat": [
      {
        "ayat_range": "1-26",
        "theme": "บทลงโทษ (หุดูด) ตามหลักการศาสนา"
      },
      {
        "ayat_range": "1-3",
        "theme": "บทลงโทษสำหรับผู้ที่ผิดประเวณี"
      },
      {
        "ayat_range": "4-5",
        "theme": "บทลงโทษสำหรับผู้ที่ใส่ร้ายหญิงที่บริสุทธิ์"
      },
      {
        "ayat_range": "6-10",
        "theme": "บทลงโทษสำหรับผู้ที่ใส่ร้ายภรรยาของตนเอง"
      },
      {
        "ayat_range": "11-22",
        "theme": "เหตุการณ์ใส่ร้ายท่านหญิงอาอิชะฮ์"
      },
      {
        "ayat_range": "23-26",
        "theme": "ผลตอบแทนของการใส่ร้ายในวันปรโลก"
      },
      {
        "ayat_range": "27-34",
        "theme": "มารยาททางสังคม (1)"
      },
      {
        "ayat_range": "27-29",
        "theme": "มารยาทในการเข้าบ้าน"
      },
      {
        "ayat_range": "30-31",
        "theme": "คำสั่งใช้ให้ผู้ชายลดสายตา และให้ผู้หญิงปกปิดเครื่องประดับ"
      },
      {
        "ayat_range": "32-34",
        "theme": "คำสั่งใช้ให้ชายและหญิงแต่งงาน และการไถ่ตัวตัวเองของทาส"
      },
      {
        "ayat_range": "35-38",
        "theme": "รัศมีของอัลลอฮ์ ความโปรดปรานและผลตอบแทนแก่ผู้ทำนุบำรุงมัสยิด"
      },
      {
        "ayat_range": "39-40",
        "theme": "อุปมาการงานของผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "41-46",
        "theme": "เดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "47-50",
        "theme": "จุดยืนของผู้กลับกลอกต่อโองการของอัลลอฮ์"
      },
      {
        "ayat_range": "51-54",
        "theme": "ผู้ศรัทธาเชื่อฟังคำตัดสินของอัลลอฮ์ ส่วนพวกกลับกลอกเชื่อฟังแบบหลอก ๆ"
      },
      {
        "ayat_range": "55-57",
        "theme": "กฎเกณฑ์ของอัลลอฮ์ต่อปวงบ่าวของพระองค์"
      },
      {
        "ayat_range": "58-63",
        "theme": "มารยาททางสังคม (2)"
      },
      {
        "ayat_range": "58-61",
        "theme": "มารยาทภายในบ้าน"
      },
      {
        "ayat_range": "62-63",
        "theme": "มารยาทของผู้ศรัทธาในการปฏิสัมพันธ์กับท่านเราะสูลุลลอฮ์"
      },
      {
        "ayat_range": "64",
        "theme": "อำนาจ ความรู้ และเดชานุภาพของอัลลอฮ์"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "25",
    "name": "Al-Furqan",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 77,
    "thematic_ayat": [
      {
        "ayat_range": "1-2",
        "theme": "ถวายความยิ่งใหญ่และเอกานุภาพแด่อัลลอฮ์"
      },
      {
        "ayat_range": "3-6",
        "theme": "ตอบโต้ข้อกล่าวอ้างที่เป็นเท็จของผู้ตั้งภาคี"
      },
      {
        "ayat_range": "7-10",
        "theme": "ผู้ตั้งภาคีจาบจ้วงต่อท่านนบี"
      },
      {
        "ayat_range": "11-14",
        "theme": "ผู้ตั้งภาคีปฏิเสธการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "15-16",
        "theme": "ผลตอบแทนของผู้ยำเกรง"
      },
      {
        "ayat_range": "17-20",
        "theme": "ผู้ตั้งภาคีและสิ่งที่กราบไหว้ของพวกเขาจะถูกรวมไว้ด้วยกัน"
      },
      {
        "ayat_range": "21-29",
        "theme": "ความคาดหวังของผู้ปฏิเสธ"
      },
      {
        "ayat_range": "30-34",
        "theme": "ทุกนบีมีศัตรู"
      },
      {
        "ayat_range": "35-40",
        "theme": "เรื่องราวของนบีบางท่าน"
      },
      {
        "ayat_range": "41-44",
        "theme": "ความหลงผิดของผู้ตั้งภาคี"
      },
      {
        "ayat_range": "45-62",
        "theme": "สัญญาณความยิ่งใหญ่ของอัลลอฮ์ในธรรมชาติ"
      },
      {
        "ayat_range": "63-77",
        "theme": "คุณลักษณะของอิบาดุรเราะห์มาน"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "26",
    "name": "Asy-Syuaraa",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 227,
    "thematic_ayat": [
      {
        "ayat_range": "1-9",
        "theme": "ความดื้อด้านของผู้ปฏิเสธ"
      },
      {
        "ayat_range": "10-22",
        "theme": "การแต่งตั้งมูซาและฮารูนเป็นเราะสูลไปดะอฺวะฮฺฟิรเอาน์"
      },
      {
        "ayat_range": "23-40",
        "theme": "นบีมูซาสนทนาและแสดงมุอฺญิซาต"
      },
      {
        "ayat_range": "41-51",
        "theme": "นบีมูซากับนักไสยศาสตร์ของฟิรเอาน์"
      },
      {
        "ayat_range": "52-68",
        "theme": "นบีมูซาพาบนีอิสรออีลออกจากอียิปต์"
      },
      {
        "ayat_range": "69-89",
        "theme": "นบีอิบรอฮีมกับกลุ่มชนของท่าน"
      },
      {
        "ayat_range": "90-104",
        "theme": "บั้นปลายในโลกหน้า"
      },
      {
        "ayat_range": "105-122",
        "theme": "นบีนูห์กับกลุ่มชนของท่าน"
      },
      {
        "ayat_range": "123-140",
        "theme": "นบีฮูดกับชาวอ๊าด"
      },
      {
        "ayat_range": "141-159",
        "theme": "นบีศอลิห์กับชาวษะมูด"
      },
      {
        "ayat_range": "160-175",
        "theme": "ของนบีลูฏกับกลุ่มชนของท่าน"
      },
      {
        "ayat_range": "176-191",
        "theme": "นบีชุอัยบ์กับชาวอัยกะฮ์"
      },
      {
        "ayat_range": "192-212",
        "theme": "อัลกุรอานและการปฏิเสธของผู้ปฏิเสธ"
      },
      {
        "ayat_range": "213-227",
        "theme": "คำแนะนำแก่นบีมุฮัมมัดและท่านไม่ใช่นักกวี"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "27",
    "name": "Annaml-1",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 93,
    "thematic_ayat": [],
    "content_detail": "สูเราะฮ์ที่ 27 มักกิยะฮ์ จำนวน 93 อายะฮ์"
  },
  {
    "surah_id": "28",
    "name": "Al-Qososh",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 88,
    "thematic_ayat": [],
    "content_detail": "สูเราะฮ์ที่ 28 มักกิยะฮ์ จำนวน 88 อายะฮ์"
  },
  {
    "surah_id": "29",
    "name": "Al-Ankabut",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 69,
    "thematic_ayat": [],
    "content_detail": "สูเราะฮ์ที่ 29 มักกิยะฮ์ จำนวน 69 อายะฮ์"
  },
  {
    "surah_id": "30",
    "name": "Ar-Rum",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 60,
    "thematic_ayat": [],
    "content_detail": "สูเราะฮ์ที่ 30 มักกิยะฮ์ จำนวน 60 อายะฮ์"
  },
  {
    "surah_id": "31",
    "name": "Luqman",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 34,
    "thematic_ayat": [
      {
        "ayat_range": "1-5",
        "theme": "อัลกุรอานและคุณลักษณะของคนดี"
      },
      {
        "ayat_range": "6-9",
        "theme": "บั้นปลายของผู้ดูหมิ่นอัลกุรอานและการตอบแทนสำหรับผู้ศรัทธา"
      },
      {
        "ayat_range": "10-11",
        "theme": "หลักฐานยืนยันเดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "12-19",
        "theme": "คำสอนของลุกมาน"
      },
      {
        "ayat_range": "20-25",
        "theme": "ความโปรดปรานของอัลลอฮ์, การดื้อดึงของผู้ตั้งภาคี และความสำเร็จของผู้ศรัทธา"
      },
      {
        "ayat_range": "26-28",
        "theme": "เดชานุภาพของอัลลอฮ์นั้นไม่มีวันหมดสิ้น"
      },
      {
        "ayat_range": "29-32",
        "theme": "สัญญาณและความโปรดปรานของอัลลอฮ์"
      },
      {
        "ayat_range": "33-34",
        "theme": "คำเตือนให้รำลึกถึงโลกหน้า"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 31 มักกิยะฮ์ จำนวน 34 อายะฮ์"
  },
  {
    "surah_id": "32",
    "name": "As-Sajdah",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 30,
    "thematic_ayat": [
      {
        "ayat_range": "1-3",
        "theme": "อัลกุรอานคือสัจธรรมและทางนำแก่มนุษย์"
      },
      {
        "ayat_range": "4-9",
        "theme": "สัญญาณยืนยันในเดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "10-14",
        "theme": "ผู้ตั้งภาคีปฏิเสธการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "15-17",
        "theme": "คุณลักษณะและการตอบแทนสำหรับผู้ศรัทธา"
      },
      {
        "ayat_range": "18-20",
        "theme": "ผู้ศรัทธาและผู้ปฏิเสธย่อมไม่เหมือนกัน"
      },
      {
        "ayat_range": "21-22",
        "theme": "การลงโทษต่อผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "23-27",
        "theme": "เตาแรต นบีมูซา และข้อตักเตือนแก่บนีอิสรออีล"
      },
      {
        "ayat_range": "28-30",
        "theme": "ในโลกหน้า การศรัทธาของผู้ปฏิเสธจะไม่มีประโยชน์ใด ๆ"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 32 มักกิยะฮ์ จำนวน 30 อายะฮ์"
  },
  {
    "surah_id": "33",
    "name": "Al-Ahzab",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 73,
    "thematic_ayat": [
      {
        "ayat_range": "1-3",
        "theme": "คำแนะนำแก่ท่านนบี"
      },
      {
        "ayat_range": "4-6",
        "theme": "การซิฮารและการรับลูกบุญธรรมไม่ใช่สิ่งที่อนุญาตในอิสลาม"
      },
      {
        "ayat_range": "7-8",
        "theme": "คำมั่นสัญญาระหว่างอัลลอฮ์กับบรรดานบี"
      },
      {
        "ayat_range": "9-20",
        "theme": "สงครามอัลอะห์ซาบ"
      },
      {
        "ayat_range": "21-24",
        "theme": "ท่านเราะสูลคือแบบอย่างของเรา"
      },
      {
        "ayat_range": "25-27",
        "theme": "ชัยชนะของผู้ศรัทธา"
      },
      {
        "ayat_range": "28-34",
        "theme": "มารยาทและคำแนะนำสำหรับภรรยาของท่านนบี"
      },
      {
        "ayat_range": "35",
        "theme": "คุณลักษณะของมุสลิม"
      },
      {
        "ayat_range": "36-40",
        "theme": "การแต่งงานของท่านนบีกับท่านหญิงซัยนับ"
      },
      {
        "ayat_range": "41-44",
        "theme": "คำสั่งให้ซิกรุลลอฮ์ให้มาก"
      },
      {
        "ayat_range": "45-48",
        "theme": "ภารกิจของท่านนบี"
      },
      {
        "ayat_range": "49",
        "theme": "การหย่าร้างโดยที่ยังมิได้มีเพศสัมพันธ์กัน"
      },
      {
        "ayat_range": "50-52",
        "theme": "สิทธิการแต่งงานของท่านนบี"
      },
      {
        "ayat_range": "53-55",
        "theme": "มารยาทในการเข้าบ้านท่านนบี"
      },
      {
        "ayat_range": "56",
        "theme": "การเศาะลาวาตให้กับท่านนบี"
      },
      {
        "ayat_range": "57-58",
        "theme": "ห้ามกล่าวร้ายต่อนบีและผู้ศรัทธา"
      },
      {
        "ayat_range": "59",
        "theme": "บทบัญญัติเกี่ยวกับหิญาบ"
      },
      {
        "ayat_range": "60-68",
        "theme": "คำตักเตือนแก่ผู้กลับกลอกและบั้นปลายของผู้ปฏิเสธ"
      },
      {
        "ayat_range": "69-71",
        "theme": "คำแนะนำแก่สังคมมุสลิม"
      },
      {
        "ayat_range": "72-73",
        "theme": "ความรับผิดชอบต่ออมานะฮ์"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 33 มะดะนียะฮ์ จำนวน 73 อายะฮ์"
  },
  {
    "surah_id": "34",
    "name": "Saba",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 54,
    "thematic_ayat": [
      {
        "ayat_range": "1-9",
        "theme": "สรรเสริญอัลลอฮ์และยืนยันเรื่องการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "10-14",
        "theme": "ความโปรดปรานของอัลลอฮ์แก่นบีดาวูดและนบีสุลัยมาน"
      },
      {
        "ayat_range": "15-21",
        "theme": "เรื่องราวของชาวสะบะอ์และน้ำจากเขื่อน"
      },
      {
        "ayat_range": "22-28",
        "theme": "คำกล่าวอ้างเรื่องการตั้งภาคีและข้อโต้แย้ง"
      },
      {
        "ayat_range": "29-33",
        "theme": "บทสนทนาระหว่างผู้ปฏิเสธศรัทธากันเอง"
      },
      {
        "ayat_range": "34-35",
        "theme": "ลักษณะของผู้ปฏิเสธ"
      },
      {
        "ayat_range": "36-39",
        "theme": "ริซกีมาจากอัลลอฮ์"
      },
      {
        "ayat_range": "40-54",
        "theme": "ข้อกล่าวอ้างอันเป็นเท็จของผู้ตั้งภาคีและข้อโต้แย้งต่อพวกเขา"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 34 มักกิยะฮ์ จำนวน 54 อายะฮ์"
  },
  {
    "surah_id": "35",
    "name": "Fatir",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 45,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "สรรเสริญต่ออัลลอฮ์"
      },
      {
        "ayat_range": "5-8",
        "theme": "ระวังการล่อลวงจากดุนยาและชัยฏอน"
      },
      {
        "ayat_range": "9-11",
        "theme": "เดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "12-14",
        "theme": "ความโปรดปรานและสัญญาณของอัลลอฮ์แก่มนุษยชาติ"
      },
      {
        "ayat_range": "15-17",
        "theme": "มนุษย์นั้นขัดสนและต้องพึ่งพาอัลลอฮ์"
      },
      {
        "ayat_range": "18-22",
        "theme": "สัจธรรมและความเท็จย่อมไม่เท่ากัน"
      },
      {
        "ayat_range": "23-26",
        "theme": "ทุกประชาชาติต่างมีผู้ตักเตือน"
      },
      {
        "ayat_range": "27-28",
        "theme": "หลักฐานยืนยันการมีอยู่ของผู้สร้าง"
      },
      {
        "ayat_range": "29-35",
        "theme": "อัลกุรอานและความสำเร็จของผู้ปฏิบัติตาม"
      },
      {
        "ayat_range": "36-38",
        "theme": "สภาพของผู้ปฏิเสธในนรกญะฮันนัม"
      },
      {
        "ayat_range": "28-30",
        "theme": "ความหายนะของผู้ปฏิเสธ *(ตามภาพต้นฉบับ)*"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 35 มักกิยะฮ์ จำนวน 45 อายะฮ์"
  },
  {
    "surah_id": "36",
    "name": "Yasin",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 83,
    "thematic_ayat": [
      {
        "ayat_range": "1-12",
        "theme": "อัลกุรอานถูกประทานมาเป็นข้อตักเตือนและข่าวดี"
      },
      {
        "ayat_range": "13-32",
        "theme": "เรื่องราวของชาวเมืองอันฏอกิยะฮ์ที่ดื้อดึง"
      },
      {
        "ayat_range": "33-44",
        "theme": "เดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "45-48",
        "theme": "จุดยืนของผู้ปฏิเสธศรัทธาต่อสัญญาณจากอัลลอฮ์"
      },
      {
        "ayat_range": "49-54",
        "theme": "สภาพของวันสิ้นโลก"
      },
      {
        "ayat_range": "55-58",
        "theme": "การตอบแทนในสวรรค์สำหรับผู้ศรัทธา"
      },
      {
        "ayat_range": "59-68",
        "theme": "บทลงโทษในนรกสำหรับผู้ปฏิเสธ"
      },
      {
        "ayat_range": "69-70",
        "theme": "นบีมุฮัมมัดไม่ใช่นักกวี"
      },
      {
        "ayat_range": "71-73",
        "theme": "เดชานุภาพและความโปรดปรานของอัลลอฮ์"
      },
      {
        "ayat_range": "74-76",
        "theme": "จุดยืนของผู้ตั้งภาคีต่อความโปรดปรานของอัลลอฮ์"
      },
      {
        "ayat_range": "77-83",
        "theme": "หลักฐานยืนยันการฟื้นคืนชีพ"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 36 มักกิยะฮ์ จำนวน 83 อายะฮ์"
  },
  {
    "surah_id": "37",
    "name": "Ash-Shoffat",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 182,
    "thematic_ayat": [
      {
        "ayat_range": "1-10",
        "theme": "อัลลอฮ์คือพระเจ้าของชั้นฟ้า&แผ่นดิน และการป้องกันจากชัยฏอน"
      },
      {
        "ayat_range": "11-21",
        "theme": "การปฏิเสธโลกหน้าและความเสียใจเมื่อมันมาถึง"
      },
      {
        "ayat_range": "22-39",
        "theme": "บทสนทนาในโลกหน้าระหว่างผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "40-49",
        "theme": "ความโปรดปรานในสวรรค์สำหรับผู้ศรัทธา"
      },
      {
        "ayat_range": "50-61",
        "theme": "ออกห่างจากเพื่อนที่ไม่ดีแล้วจะประสบความสำเร็จ"
      },
      {
        "ayat_range": "62-74",
        "theme": "ต้นซักกูมคืออาหารของชาวนรก"
      },
      {
        "ayat_range": "75-82",
        "theme": "นบีนูห์และผู้ศรัทธาที่ปลอดภัยจากมหันตภัย"
      },
      {
        "ayat_range": "83-98",
        "theme": "นบีอิบรอฮีมและการดะอ์วะฮ์กลุ่มชนของท่าน"
      },
      {
        "ayat_range": "99-113",
        "theme": "อัลลอฮ์ทรงทดสอบให้นบีอิบรอฮีมเชือดลูกชาย"
      },
      {
        "ayat_range": "114-122",
        "theme": "เกี่ยวกับนบีมูซาและนบีฮารูน"
      },
      {
        "ayat_range": "123-132",
        "theme": "การดะอ์วะฮ์ของนบีอิลยาส"
      },
      {
        "ayat_range": "133-138",
        "theme": "เกี่ยวกับนบีลูฏ"
      },
      {
        "ayat_range": "139-148",
        "theme": "บททดสอบของนบียูนุส"
      },
      {
        "ayat_range": "149-157",
        "theme": "ผู้ตั้งภาคีอ้างว่ามลาอิกะฮ์คือลูกสาวของอัลลอฮ์"
      },
      {
        "ayat_range": "158-166",
        "theme": "อัลลอฮ์ทรงบริสุทธิ์จากข้อกล่าวอ้างทั้งหลาย"
      },
      {
        "ayat_range": "167-170",
        "theme": "ผู้ตั้งภาคีปฏิเสธคัมภีร์อัลกุรอาน"
      },
      {
        "ayat_range": "171-182",
        "theme": "อัลลอฮ์สัญญาว่าจะทรงช่วยเหลือบรรดาเราะสูลของพระองค์"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 37 มักกิยะฮ์ จำนวน 182 อายะฮ์"
  },
  {
    "surah_id": "38",
    "name": "Shad",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 88,
    "thematic_ayat": [
      {
        "ayat_range": "1-11",
        "theme": "ข้อโต้แย้งต่อผู้ตั้งภาคี"
      },
      {
        "ayat_range": "12-16",
        "theme": "การปฏิเสธเราะสูลของประชาชาติรุ่นก่อน"
      },
      {
        "ayat_range": "17-26",
        "theme": "เรื่องราวของนบีดาวูด"
      },
      {
        "ayat_range": "27-29",
        "theme": "ผู้ศรัทธาและทำความดีไม่เหมือนผู้บ่อนทำลาย"
      },
      {
        "ayat_range": "30-40",
        "theme": "เรื่องราวของนบีสุลัยมาน"
      },
      {
        "ayat_range": "41-44",
        "theme": "เรื่องราวของนบีอัยยูบ"
      },
      {
        "ayat_range": "45-48",
        "theme": "กล่าวถึงนบีอิบรอฮีมและนบีท่านอื่น ๆ"
      },
      {
        "ayat_range": "49-64",
        "theme": "การตอบแทนสำหรับผู้ยำเกรงและผู้ละเมิด"
      },
      {
        "ayat_range": "65-70",
        "theme": "ยืนยันในการเป็นนบี"
      },
      {
        "ayat_range": "71-85",
        "theme": "เรื่องราวของนบีอาดัมและความโสโฮังของอิบลีส"
      },
      {
        "ayat_range": "86-88",
        "theme": "อัลกุรอานคือข้อตักเตือน"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 38 มักกิยะฮ์ จำนวน 88 อายะฮ์"
  },
  {
    "surah_id": "39",
    "name": "Az-Zumar",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 75,
    "thematic_ayat": [
      {
        "ayat_range": "1-5",
        "theme": "เรียกร้องไปสู่เอกานุภาพของพระเจ้า"
      },
      {
        "ayat_range": "6-8",
        "theme": "การสร้างและพฤติกรรมของมนุษย์"
      },
      {
        "ayat_range": "9-10",
        "theme": "สภาพของผู้ศรัทธาต่ออัลลอฮ์"
      },
      {
        "ayat_range": "11-20",
        "theme": "วิถีของมุสลิมผู้ยอมจำนนต่ออัลลอฮ์"
      },
      {
        "ayat_range": "21-26",
        "theme": "การตอบแทนสำหรับมุสลิมและผู้ปฏิเสธ"
      },
      {
        "ayat_range": "27-31",
        "theme": "อุปมาอุปไมยในอัลกุรอาน"
      },
      {
        "ayat_range": "32-37",
        "theme": "ระหว่างผู้ยำเกรงกับผู้ปฏิเสธ"
      },
      {
        "ayat_range": "38-40",
        "theme": "ผู้ตั้งภาคีก็ยอมรับในอัลลอฮ์"
      },
      {
        "ayat_range": "41",
        "theme": "อัลกุรอานนำทางสู่สัจธรรม"
      },
      {
        "ayat_range": "42-44",
        "theme": "ทุกชีวิตล้วนมีกำหนดการตาย"
      },
      {
        "ayat_range": "45-48",
        "theme": "ผู้ตั้งภาคีรู้สึกยินดีกับภาคีของพวกเขา"
      },
      {
        "ayat_range": "49-52",
        "theme": "สภาพของผู้ปฏิเสธศรัทธาเมื่อประสบกับทุกข์ภัยและความโปรดปราน"
      },
      {
        "ayat_range": "53-56",
        "theme": "อย่าสิ้นหวังในความเมตตาของอัลลอฮ์"
      },
      {
        "ayat_range": "57-59",
        "theme": "ความเสียใจของผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "60-67",
        "theme": "ความสำเร็จในโลกหน้าของบรรดารผู้ศรัทธา"
      },
      {
        "ayat_range": "68-70",
        "theme": "ส่วนหนึ่งของเหตุการณ์ในโลกหน้า"
      },
      {
        "ayat_range": "71-72",
        "theme": "ผู้ปฏิเสธจะถูกไล่ต้อนไปสู่นรกญะฮันนัม"
      },
      {
        "ayat_range": "73-75",
        "theme": "ผู้ศรัทธาจะถูกนำไปยังสวนสวรรค์"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 39 มักกิยะฮ์ จำนวน 75 อายะฮ์"
  },
  {
    "surah_id": "40",
    "name": "Ghafir",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 85,
    "thematic_ayat": [
      {
        "ayat_range": "1-3",
        "theme": "คุณลักษณะของอัลลอฮ์"
      },
      {
        "ayat_range": "4-6",
        "theme": "สภาพของผู้ปฏิเสธและกลุ่มชนในอดีต"
      },
      {
        "ayat_range": "7-9",
        "theme": "เกี่ยวกับมลาอิกะฮ์ผู้แบกบัลลังก์"
      },
      {
        "ayat_range": "10-12",
        "theme": "ความกริ้วของอัลลอฮ์ต่อผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "13-15",
        "theme": "เดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "16-20",
        "theme": "สภาพของวันสิ้นโลก"
      },
      {
        "ayat_range": "21-22",
        "theme": "บั้นปลายของกลุ่มชนที่ปฏิเสธในอดีต"
      },
      {
        "ayat_range": "23-27",
        "theme": "เรื่องราวของนบีมูซากับฟิรเอาน์ ฮามาน และกอรูน"
      },
      {
        "ayat_range": "28-46",
        "theme": "เรื่องราวของผู้ศรัทธาในพวกพ้องของฟิรเอาน์"
      },
      {
        "ayat_range": "47-50",
        "theme": "บทสนทนาในโลกหน้า ระหว่างผู้นำและผู้ตามของผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "51-55",
        "theme": "อัลลอฮ์จะทรงช่วยเหลือบรรดาเราะสูลและผู้ศรัทธา"
      },
      {
        "ayat_range": "56-76",
        "theme": "ความยโสโอหังและบั้นปลายของมัน"
      },
      {
        "ayat_range": "77-78",
        "theme": "คำแนะนำแก่ท่านเราะสูลุลลอฮ์"
      },
      {
        "ayat_range": "79-81",
        "theme": "ความโปรดปรานของอัลลอฮ์"
      },
      {
        "ayat_range": "82-85",
        "theme": "คำเตือนสำทับแก่ผู้ปฏิเสธศรัทธา"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 40 มักกิยะฮ์ จำนวน 85 อายะฮ์"
  },
  {
    "surah_id": "41",
    "name": "Fusshilat",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 54,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "หน้าที่และความสำคัญของอัลกุรอาน"
      },
      {
        "ayat_range": "5-8",
        "theme": "จุดยืนของผู้ตั้งภาคีต่ออัลกุรอานและท่านนบี"
      },
      {
        "ayat_range": "9-12",
        "theme": "หลักฐานยืนยันการมีอยู่และเดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "13-18",
        "theme": "คำเตือนสำหรับผู้ตั้งภาคีและตัวอย่างกลุ่มชนในอดีต"
      },
      {
        "ayat_range": "19-29",
        "theme": "บั้นปลายของผู้ที่เป็นศัตรูกับอัลลอฮ์"
      },
      {
        "ayat_range": "30-32",
        "theme": "รางวัลแด่ผู้ที่ยืนหยัด"
      },
      {
        "ayat_range": "33-36",
        "theme": "ความประเสริฐของผู้ที่เรียกร้องไปสู่อัลลอฮ์"
      },
      {
        "ayat_range": "37-39",
        "theme": "เดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "40-44",
        "theme": "คำเตือนแด่ผู้ที่บิดเบือนโองการของอัลลอฮ์"
      },
      {
        "ayat_range": "45-46",
        "theme": "มนุษย์ขัดแย้งกันในเรื่องคัมภีร์เตารอฮ์"
      },
      {
        "ayat_range": "47-48",
        "theme": "อัลลอฮ์เท่านั้นที่รู้เรื่องสิ่งเร้นลับและวันสิ้นโลก"
      },
      {
        "ayat_range": "49-52",
        "theme": "พฤติกรรมของมนุษย์ในยามทุกข์และสุข"
      },
      {
        "ayat_range": "53-54",
        "theme": "ยืนยันว่าอัลกุรอานคือความจริง"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 41 มักกิยะฮ์ จำนวน 54 อายะฮ์"
  },
  {
    "surah_id": "42",
    "name": "Asy-Syura",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 53,
    "thematic_ayat": [
      {
        "ayat_range": "1-6",
        "theme": "อัลลอฮ์คือพระเจ้าผู้ประทานวะหีย์แก่นบีทั้งหลาย"
      },
      {
        "ayat_range": "7-8",
        "theme": "อัลกุรอานและจุดยืนของมนุษย์"
      },
      {
        "ayat_range": "9-12",
        "theme": "มอบหมายต่ออัลลอฮ์"
      },
      {
        "ayat_range": "13-15",
        "theme": "ยืนหยัดในศาสนาเดียวที่อัลลอฮ์มอบให้"
      },
      {
        "ayat_range": "16-19",
        "theme": "ท่าทีของผู้ปฏิเสธและผู้ศรัทธาต่อวันสิ้นโลก"
      },
      {
        "ayat_range": "20-26",
        "theme": "ผลตอบแทนของผู้ศรัทธาและผู้ปฏิเสธ"
      },
      {
        "ayat_range": "27-36",
        "theme": "กฎเกณฑ์และเดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "37-46",
        "theme": "คุณลักษณะของผู้ศรัทธาและบั้นปลายของผู้ปฏิเสธ"
      },
      {
        "ayat_range": "47-50",
        "theme": "เตือนสำทับก่อนวันสิ้นโลกมาถึง"
      },
      {
        "ayat_range": "51-53",
        "theme": "รูปแบบต่าง ๆ ของวะหีย์"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 42 มักกิยะฮ์ จำนวน 53 อายะฮ์"
  },
  {
    "surah_id": "43",
    "name": "Az-Zukhruf",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 89,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "สถานภาพของอัลกุรอาน"
      },
      {
        "ayat_range": "5-8",
        "theme": "บั้นปลายของผู้ที่ฝ่าฝืน"
      },
      {
        "ayat_range": "9-14",
        "theme": "ความยิ่งใหญ่และความโปรดปรานของอัลลอฮ์"
      },
      {
        "ayat_range": "15-25",
        "theme": "คำอุปโลกน์ของผู้ตั้งภาคีและข้อโต้แย้งต่อพวกเขา"
      },
      {
        "ayat_range": "26-28",
        "theme": "นบีอิบรอฮีมไม่เกี่ยวข้องกับการกราบไหว้รูปเจว็ด"
      },
      {
        "ayat_range": "29-45",
        "theme": "ผู้ที่ปฏิเสธศรัทธาและผินหลังให้อัลลอฮ์มีชัยฏอนเป็นมิตรสหาย"
      },
      {
        "ayat_range": "46-56",
        "theme": "เรื่องราวของนบีมูซากับฟิรเอาน์"
      },
      {
        "ayat_range": "57-66",
        "theme": "เรื่องราวของนบีอีซา"
      },
      {
        "ayat_range": "67-80",
        "theme": "การตอบแทนสำหรับผู้ยำเกรงและผู้ที่ทำความชั่ว"
      },
      {
        "ayat_range": "81-89",
        "theme": "ยืนยันในเอกานุภาพของอัลลอฮ์"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 43 มักกิยะฮ์ จำนวน 89 อายะฮ์"
  },
  {
    "surah_id": "44",
    "name": "Ad-Dukhon",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 59,
    "thematic_ayat": [
      {
        "ayat_range": "1-8",
        "theme": "อัลลอฮ์ทรงสาบานต่อคัมภีร์อัลกุรอานที่ถูกประทานลงมาในคืนลัยละตุลก๊อดรุ"
      },
      {
        "ayat_range": "9-16",
        "theme": "ผู้ที่ปฏิเสธนบีและบั้นปลายของพวกเขา"
      },
      {
        "ayat_range": "17-33",
        "theme": "เรื่องราวความหายนะของฟิรเอาน์และพลพรรคของเขา"
      },
      {
        "ayat_range": "34-39",
        "theme": "ผู้ตั้งภาคีปฏิเสธการฟื้นคืนชีพและข้อโต้แย้งต่อพวกเขา"
      },
      {
        "ayat_range": "40-50",
        "theme": "บั้นปลายในโลกหน้าของผู้ตั้งภาคี"
      },
      {
        "ayat_range": "51-57",
        "theme": "ความโปรดปรานในสวรรค์สำหรับผู้ยำเกรง"
      },
      {
        "ayat_range": "58-59",
        "theme": "อัลลอฮ์ทรงทำให้อัลกุรอานนั้นง่ายดาย"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 44 มักกิยะฮ์ จำนวน 59 อายะฮ์"
  },
  {
    "surah_id": "45",
    "name": "Al-Jatsiyah-1",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 37,
    "thematic_ayat": [
      {
        "ayat_range": "1-6",
        "theme": "หลักฐานยืนยันในเอกานุภาพและเดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "7-11",
        "theme": "สำทับเตือนผู้ที่ปฏิเสธโองการของอัลลอฮ์"
      },
      {
        "ayat_range": "12-22",
        "theme": "ความโปรดปรานที่อัลลอฮ์ประทานให้ปวงบ่าวและบนีอิสรออีล"
      },
      {
        "ayat_range": "23-26",
        "theme": "ความหลงผิดของผู้ที่ยึดถืออารมณ์ใฝ่ต่ำเป็นพระเจ้า"
      },
      {
        "ayat_range": "27-35",
        "theme": "การตอบแทนสำหรับผู้ศรัทธาและผู้ปฏิเสธวันแห่งการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "36-37",
        "theme": "มวลการสรรเสริญและความยิ่งใหญ่เป็นของอัลลอฮ์"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 45 มักกิยะฮ์ จำนวน 37 อายะฮ์"
  },
  {
    "surah_id": "46",
    "name": "Al-Ahqof-1",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 35,
    "thematic_ayat": [
      {
        "ayat_range": "1-5",
        "theme": "อัลกุรอานสำทับเตือนและท้าทายผู้ตั้งภาคีให้นำสิ่งที่เหมือนกันมา"
      },
      {
        "ayat_range": "6-14",
        "theme": "นบีมุฮัมมัดมิได้เป็นคนแรกในหมู่เราะสูลที่นำคัมภีร์มา"
      },
      {
        "ayat_range": "15-18",
        "theme": "การกตัญญูต่อพ่อแม่"
      },
      {
        "ayat_range": "19-20",
        "theme": "ทุกกลุ่มมีระดับขั้นตามการงานที่ได้ทำไว้"
      },
      {
        "ayat_range": "21-28",
        "theme": "เรื่องราวของนบีฮูดกับชาวอ๊าด และคำเตือนแก่ชาวกุร็อยช์มักกะฮ์"
      },
      {
        "ayat_range": "29-32",
        "theme": "การศรัทธาและรับอิสลามของญินบางกลุ่ม"
      },
      {
        "ayat_range": "33-35",
        "theme": "ผู้ปฏิเสธศรัทธาจะถูกนำไปยังนรกและจงอดทนเหมือน \"อุลุลอัซม์\" ในหมู่เราะสูล"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 46 มักกิยะฮ์ จำนวน 35 อายะฮ์"
  },
  {
    "surah_id": "47",
    "name": "Muhammad",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 38,
    "thematic_ayat": [
      {
        "ayat_range": "1-3",
        "theme": "สภาพและผลตอบแทนของผู้ปฏิเสธและผู้ศรัทธา"
      },
      {
        "ayat_range": "4-6",
        "theme": "คำสั่งใช้และผลตอบแทนของการญิฮาด"
      },
      {
        "ayat_range": "7-14",
        "theme": "ผู้ศรัทธาจะได้รับชัยชนะส่วนผู้ปฏิเสธจะหายนะ"
      },
      {
        "ayat_range": "15-18",
        "theme": "สิ่งที่อัลลอฮ์เตรียมไว้แก่ผู้ศรัทธาและผู้ปฏิเสธ"
      },
      {
        "ayat_range": "19",
        "theme": "คำสั่งให้เรียนรู้ให้เอกภาพแด่อัลลอฮ์และขออภัยโทษต่อพระองค์"
      },
      {
        "ayat_range": "20-34",
        "theme": "สภาพของผู้กลับกลอกและบททดสอบของเหล่านักสู้ (มุญาฮิดีน)"
      },
      {
        "ayat_range": "35-38",
        "theme": "แก่นแท้ของดุนยาและคำสั่งให้บริจาคและทำการญิฮาด"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 47 มะดะนียะฮ์ จำนวน 38 อายะฮ์"
  },
  {
    "surah_id": "48",
    "name": "Al-Fath",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 29,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "สนธิสัญญาหุดัยบียะฮ์"
      },
      {
        "ayat_range": "5-7",
        "theme": "การตอบแทนสำหรับผู้ศรัทธา พวกกลับกลอก และผู้ตั้งภาคี"
      },
      {
        "ayat_range": "8-10",
        "theme": "บทบาทของท่านเราะสูลและสัตยาบันของเศาะหาบะฮ์"
      },
      {
        "ayat_range": "11-17",
        "theme": "ธาตุแท้และบั้นปลายของพวกกลับกลอก"
      },
      {
        "ayat_range": "18-26",
        "theme": "สัตยาบันอัรริฎวานและผลลัพธ์ของสนธิสัญญาหุดัยบียะฮ์"
      },
      {
        "ayat_range": "27-28",
        "theme": "ฝันของท่านเราะสูลเป็นความจริง"
      },
      {
        "ayat_range": "29",
        "theme": "คุณลักษณะของเศาะหาบะฮ์นบีในคัมภีร์เตารอฮ์และอินญีล"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 48 มะดะนียะฮ์ จำนวน 29 อายะฮ์"
  },
  {
    "surah_id": "49",
    "name": "Alhujurat",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 18,
    "thematic_ayat": [
      {
        "ayat_range": "1-5",
        "theme": "มารยาทต่ออัลลอฮ์และท่านเราะสูลุลลอฮ์"
      },
      {
        "ayat_range": "6-8",
        "theme": "การตรวจสอบข่าวสาร"
      },
      {
        "ayat_range": "9-12",
        "theme": "มารยาทและการปฏิสัมพันธ์ที่ดี"
      },
      {
        "ayat_range": "13",
        "theme": "ผู้ที่มีเกียรติที่สุดคือผู้ที่ยำเกรงต่ออัลลอฮ์มากที่สุด"
      },
      {
        "ayat_range": "14-18",
        "theme": "แก่นแท้จริงของความศรัทธาและพระมหากรุณาธิคุณของอัลลอฮ์"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 49 มะดะนียะฮ์ จำนวน 18 อายะฮ์"
  },
  {
    "surah_id": "50",
    "name": "Qof",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 45,
    "thematic_ayat": [
      {
        "ayat_range": "1-5",
        "theme": "ผู้ตั้งภาคีปฏิเสธการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "6-11",
        "theme": "หลักฐานยืนยันเรื่องการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "12-14",
        "theme": "กลุ่มชนในอดีตก็เคยปฏิเสธการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "15-18",
        "theme": "อัลลอฮ์ทรงเดชานุภาพในการสร้างและพระองค์ทรงอยู่ใกล้"
      },
      {
        "ayat_range": "19-30",
        "theme": "ความตายและการฟื้นคืนชีพ และบทสนทนาในโลกหน้า ระหว่างผู้ปฏิเสธศรัทธาและสหายของเขา"
      },
      {
        "ayat_range": "31-35",
        "theme": "การตอบแทนและลักษณะของผู้ศรัทธา"
      },
      {
        "ayat_range": "36-45",
        "theme": "คำเตือนสำหรับผู้ปฏิเสธการฟื้นคืนชีพ และคำแนะนำสำหรับท่านเราะสูล"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 50 มะดะนียะฮ์ จำนวน 45 อายะฮ์"
  },
  {
    "surah_id": "51",
    "name": "Az-Zariyat",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 60,
    "thematic_ayat": [
      {
        "ayat_range": "1-14",
        "theme": "การฟื้นคืนชีพและบั้นปลายของผู้ปฏิเสธ"
      },
      {
        "ayat_range": "15-19",
        "theme": "การตอบแทนสำหรับผู้ยำเกรงและคุณลักษณะของพวกเขา"
      },
      {
        "ayat_range": "20-23",
        "theme": "สัญญาณของอัลลอฮ์และเดชานุภาพของพระองค์"
      },
      {
        "ayat_range": "24-37",
        "theme": "เรื่องราวของแขกนบีอิบรอฮีม"
      },
      {
        "ayat_range": "38-46",
        "theme": "เกี่ยวกับนบีบางท่าน"
      },
      {
        "ayat_range": "47-51",
        "theme": "จงรีบเร่งเข้าหาอัลลอฮ์เถิด"
      },
      {
        "ayat_range": "52-60",
        "theme": "บั้นปลายของผู้ที่ผินหลังให้เราะสูลและผู้อธรรม"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 51 มักกิยะฮ์ จำนวน 60 อายะฮ์"
  },
  {
    "surah_id": "52",
    "name": "At-Tur",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 49,
    "thematic_ayat": [
      {
        "ayat_range": "1-16",
        "theme": "ยืนยันเรื่องการลงโทษสำหรับผู้ปฏิเสธ"
      },
      {
        "ayat_range": "17-28",
        "theme": "ความโปรดปรานที่หลากหลายสำหรับผู้ยำเกรง"
      },
      {
        "ayat_range": "29-47",
        "theme": "ความเชื่อของผู้ปฏิเสธศรัทธาและข้อโต้แย้ง"
      },
      {
        "ayat_range": "48-49",
        "theme": "คำแนะนำแก่ท่านเราะสูล"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 52 มักกิยะฮ์ จำนวน 49 อายะฮ์"
  },
  {
    "surah_id": "53",
    "name": "An-Najm",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 62,
    "thematic_ayat": [
      {
        "ayat_range": "1-18",
        "theme": "ท่านนบีได้รับวะหีย์จากอัลลอฮ์จริง"
      },
      {
        "ayat_range": "19-30",
        "theme": "เกี่ยวกับการบูชาและกราบไหว้รูปเจว็ด"
      },
      {
        "ayat_range": "31-41",
        "theme": "การตอบแทนที่ยุติธรรมแก่คนที่ทำความดีและคนชั่ว และลักษณะของพวกเขา"
      },
      {
        "ayat_range": "42-56",
        "theme": "อัลลอฮ์คือผู้สร้าง พระองค์ทรงทำลายกลุ่มชนที่ปฏิเสธ"
      },
      {
        "ayat_range": "57-62",
        "theme": "วันสิ้นโลกใกล้เข้ามาแล้ว"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 53 มักกิยะฮ์ จำนวน 62 อายะฮ์"
  },
  {
    "surah_id": "54",
    "name": "Al-Qomar",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 55,
    "thematic_ayat": [
      {
        "ayat_range": "1-8",
        "theme": "มุอ์ญิซาตการผ่าดวงจันทร์"
      },
      {
        "ayat_range": "9-17",
        "theme": "เรื่องราวของนบีนูห์"
      },
      {
        "ayat_range": "18-22",
        "theme": "เรื่องราวของชาวอาด"
      },
      {
        "ayat_range": "23-32",
        "theme": "เรื่องราวของชาวซะมูด"
      },
      {
        "ayat_range": "33-40",
        "theme": "เรื่องราวของนบีลูฏ"
      },
      {
        "ayat_range": "41-42",
        "theme": "เรื่องราวของครอบครัวอิมรอน"
      },
      {
        "ayat_range": "43-53",
        "theme": "บั้นปลายของคนชั่ว"
      },
      {
        "ayat_range": "54-55",
        "theme": "ผลตอบแทนสำหรับผู้ยำเกรง"
      }
    ],
    "content_detail": "“อัลเกาะมัร” หมายถึง ดวงจันทร์ เกี่ยวข้องกับเหตุการณ์จันทร์แยก ซึ่งเป็นมุอ์ญิซาตของท่านนบีมุฮัมมัด ชาวมุชริกีนปฏิเสธเรื่องนี้ แต่คาราวานสินค้าที่เดินทางมาจากที่อื่นยืนยันว่า พวกเขาเห็นดวงจันทร์ถูกผ่าออกจริง แล้วสูเราะฮ์อัลเกาะมัรนี้ก็ถูกประทานลงมา ในบันทึกของอิมามมุสลิมมีหะดีษระบุว่า ท่านนบีมักจะอ่านสูเราะฮ์นี้ในละหมาดอีดฟิฏรีย์และอีดอัฎฮา"
  },
  {
    "surah_id": "55",
    "name": "Ar-Rahman",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 78,
    "thematic_ayat": [
      {
        "ayat_range": "1-25",
        "theme": "ความโปรดปรานของอัลลอฮ์ที่มีต่อปวงบ่าวของพระองค์"
      },
      {
        "ayat_range": "26-30",
        "theme": "อัลลอฮ์เท่านั้นที่คงอยู่ชั่วนิรันดร์"
      },
      {
        "ayat_range": "31-36",
        "theme": "อัลลอฮ์ทรงเดชานุภาพเหนือมนุษย์และญิน"
      },
      {
        "ayat_range": "37-45",
        "theme": "บั้นปลายในโลกหน้าของคนชั่ว"
      },
      {
        "ayat_range": "46-78",
        "theme": "สภาพของสวนสวรรค์สำหรับผู้ที่เกรงกลัวอัลลอฮ์"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 55 มะดะนียะฮ์ จำนวน 78 อายะฮ์"
  },
  {
    "surah_id": "56",
    "name": "Al-Waqiah",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 96,
    "thematic_ayat": [
      {
        "ayat_range": "1-10",
        "theme": "สภาพวันสิ้นโลก"
      },
      {
        "ayat_range": "11-26",
        "theme": "ความโปรดปรานในสวนสวรรค์สำหรับกลุ่มชนแนวหน้า"
      },
      {
        "ayat_range": "27-40",
        "theme": "ความโปรดปรานสำหรับกลุ่มชนทางขวา"
      },
      {
        "ayat_range": "41-56",
        "theme": "บทลงโทษสำหรับกลุ่มชนทางซ้าย"
      },
      {
        "ayat_range": "57-74",
        "theme": "ความโปรดปรานและสัญญาณในธรรมชาติที่ยืนยันในเดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "75-87",
        "theme": "ความยิ่งใหญ่ของอัลกุรอาน"
      },
      {
        "ayat_range": "88-96",
        "theme": "บทสรุปของกลุ่มคนทั้ง 3 กลุ่ม"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 56 มักกิยะฮ์ จำนวน 96 อายะฮ์"
  },
  {
    "surah_id": "57",
    "name": "Al-Hadid",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 29,
    "thematic_ayat": [
      {
        "ayat_range": "1-6",
        "theme": "แซ่ซ้องสดุดีอัลลอฮ์"
      },
      {
        "ayat_range": "7-12",
        "theme": "ศรัทธา บริจาค และการตอบแทนสำหรับผู้ยำเกรง"
      },
      {
        "ayat_range": "13-15",
        "theme": "บทสนทนาในโลกหน้าระหว่างผู้ศรัทธากับผู้กลับกลอก"
      },
      {
        "ayat_range": "16-19",
        "theme": "คำแนะนำและการตอบแทนสำหรับผู้ศรัทธาและผู้ปฏิเสธ"
      },
      {
        "ayat_range": "20-21",
        "theme": "ชีวิตในโลกนี้และการงานที่ดี"
      },
      {
        "ayat_range": "22-24",
        "theme": "การศรัทธาต่อเกาะฎออ์-เกาะดัร"
      },
      {
        "ayat_range": "25-27",
        "theme": "เป้าหมายของการส่งบรรดารสูล"
      },
      {
        "ayat_range": "28-29",
        "theme": "คำสั่งใช้ให้ศรัทธาและความโปรดปรานทั้งหลายอยู่ในพระหัตถ์ของพระองค์"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 57 มะดะนียะฮ์ จำนวน 29 อายะฮ์"
  },
  {
    "surah_id": "58",
    "name": "Al-Mujadalah",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 22,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "เกี่ยวกับการซิฮาร"
      },
      {
        "ayat_range": "5-6",
        "theme": "เตือนสำทับผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "7",
        "theme": "อัลลอฮ์ทรงรอบรู้ทุกสิ่ง"
      },
      {
        "ayat_range": "8-13",
        "theme": "เกี่ยวกับการซุบซิบ การร่วมชุมนุม และการปรึกษาหารือกับท่านเราะสูลุลลอฮ์"
      },
      {
        "ayat_range": "14-22",
        "theme": "การเป็นมิตรกับผู้ปฏิเสธศรัทธาและบั้นปลายของมัน"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 58 มะดะนียะฮ์ จำนวน 22 อายะฮ์"
  },
  {
    "surah_id": "59",
    "name": "Al-Hasyr",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 24,
    "thematic_ayat": [
      {
        "ayat_range": "1-5",
        "theme": "การเนรเทศชาวยิวตระกูลบันเฎียร"
      },
      {
        "ayat_range": "6-7",
        "theme": "บัญญัติเกี่ยวกับอัลฟัยอ์ (ทรัพย์สินที่ยึดมาได้)"
      },
      {
        "ayat_range": "8-10",
        "theme": "ความประเสริฐของชาวมุฮาญิรีนที่ขัดสนและชาวอันศอร"
      },
      {
        "ayat_range": "11-17",
        "theme": "พวกกลับกลอกเป็นมิตรกับชาวยิวและหักหลังมุสลิม"
      },
      {
        "ayat_range": "18-21",
        "theme": "ตักวา ความสำเร็จ และอัลกุรอาน"
      },
      {
        "ayat_range": "22-24",
        "theme": "พระนามและคุณลักษณะของอัลลอฮ์"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 59 มะดะนียะฮ์ จำนวน 24 อายะฮ์"
  },
  {
    "surah_id": "60",
    "name": "Al-Mumtahanah",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 13,
    "thematic_ayat": [
      {
        "ayat_range": "1-3",
        "theme": "ห้ามเป็นมิตรกับผู้ปฏิเสธ"
      },
      {
        "ayat_range": "4-7",
        "theme": "เรื่องราวของนบีอิบรอฮีม"
      },
      {
        "ayat_range": "8-9",
        "theme": "ความสัมพันธ์ระหว่างผู้ศรัทธากับผู้ปฏิเสธ"
      },
      {
        "ayat_range": "10-12",
        "theme": "บัญญัติเกี่ยวกับผู้หญิงที่อพยพหรือหลี้ภัยและการทำสัตยาบันของพวกนาง"
      },
      {
        "ayat_range": "13",
        "theme": "ยืนยันข้อห้ามการเป็นมิตรกับผู้ปฏิเสธศรัทธา"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 60 มะดะนียะฮ์ จำนวน 13 อายะฮ์"
  },
  {
    "surah_id": "61",
    "name": "Ash-Shof",
    "reveal": "มะดะนิยะฮ์",
    "max_ayat": 14,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "แซ่ซ้องสดุดีต่ออัลลอฮ์ และการต่อสู้ในหนทางของพระองค์"
      },
      {
        "ayat_range": "5-9",
        "theme": "คำเรียกร้องของนบีมูซาและนบีอีซาแก่กลุ่มชนของท่าน"
      },
      {
        "ayat_range": "10-14",
        "theme": "การค้าขายที่ประสบความสำเร็จ คือการเป็นผู้ช่วยเหลืออัลลอฮ์"
      },
      {
        "ayat_range": "4",
        "theme": "ชื่อว่า “อัศศ็อฟ” หมายถึง แถวเดียวกัน เป็นคำที่ปรากฏอยู่ในอายะฮ์ที่ 4 โดยอัลลอฮ์ได้กล่าวถึงสิ่งที่พระองค์รัก คือ การที่ผู้ศรัทธาต่อสู้ในหนทางของพระองค์เป็นแถวเดียวกัน"
      },
      {
        "ayat_range": "3",
        "theme": "่อนหน้านี้ในอายะฮ์ที่ 3 พระองค์ได้กล่าวถึงสิ่งที่พระองค์ไม่ชอบ คือ การที่คน ๆ พูดบางอย่าง แต่เขากลับไม่ทำตามที่ได้พูดออกไป"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "62",
    "name": "Al-Jumuah",
    "reveal": "มะดะนิยะฮ์",
    "max_ayat": 11,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "แซ่ซ้องสดุดีอัลลอฮ์ และหน้าที่ของท่านเราะซูล"
      },
      {
        "ayat_range": "5-8",
        "theme": "เปรียบชาวยิวเหมือนพวกลา"
      },
      {
        "ayat_range": "9-11",
        "theme": "บทบัญญัติเกี่ยวกับวันศุกร์"
      },
      {
        "ayat_range": "9",
        "theme": "ชื่อว่า “อัลญุมุอะฮ์” หมายถึง วันศุกร์ หรือในทางภาษาหมายถึง วันชุมนุม โดยคำนี้ปรากฏอยู่ในอายะฮ์ที่ 9 ของสูเราะฮ์"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "63",
    "name": "Al-Munafiqun",
    "reveal": "มะดะนิยะฮ์",
    "max_ayat": 11,
    "thematic_ayat": [
      {
        "ayat_range": "1-8",
        "theme": "ลักษณะของพวกกลับกลอก"
      },
      {
        "ayat_range": "9-11",
        "theme": "คำแนะนำสำหรับผู้ศรัทธา"
      }
    ],
    "content_detail": "สูเราะฮ์นี้ได้ชื่อว่า “อัลมุนาฟิกูน” เนื่องจากเนื้อหาหลักของสูเราะฮ์ได้กล่าวถึงพวกมุนาฟิกูน ซึ่งมีพฤติกรรมหน้าไหว้หลังหลอกและกลับกลอกในความศรัทธา เช่น เป็นพวกที่ศรัทธาจอมปลอม, ชอบโกหก, สาบานเท็จ, ยโสโอหัง, ตระหนี่ถี่เหนียว และไม่รักษาสัญญา"
  },
  {
    "surah_id": "64",
    "name": "At-Taghabun",
    "reveal": "มะดะนิยะฮ์",
    "max_ayat": 18,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "เดชานุภาพและความรอบรู้ของอัลลอฮ์"
      },
      {
        "ayat_range": "5-6",
        "theme": "กลุ่มชนที่ปฏิเสธพระเจ้า"
      },
      {
        "ayat_range": "7-10",
        "theme": "ผลตอบแทนสำหรับผู้ตั้งภาคีที่ปฏิเสธการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "11-18",
        "theme": "คำแนะนำสำหรับผู้ศรัทธา"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "65",
    "name": "At-Talaq",
    "reveal": "มะดะนิยะฮ์",
    "max_ayat": 12,
    "thematic_ayat": [
      {
        "ayat_range": "1-7",
        "theme": "บทบัญญัติเกี่ยวกับการหย่าร้าง, อิดดะฮ์, การพักอาศัย และนัฟเกาะฮ์"
      },
      {
        "ayat_range": "8-11",
        "theme": "คำเตือนแด่ผู้ดื้อรั้น และคำสัญญาสำหรับผู้ศรัทธา"
      },
      {
        "ayat_range": "12",
        "theme": "เดชานุภาพของอัลลอฮ์"
      }
    ],
    "content_detail": "สูเราะฮ์นี้ชื่อว่า “อัฏเฏาะลาก” หมายถึง การหย่าร้าง เนื่องจากเนื้อหาหลักของสูเราะฮ์กล่าวถึงเรื่องการหย่าร้าง และอื่น ๆ ที่เกี่ยวข้อง เช่น เรื่องอิดดะฮ์ (ระยะรอคอยหลังเกิดการหย่าร้าง), คำสั่งใช้ให้ผู้หญิงยังคงอยู่ในบ้านของสามีในช่วงเวลาอิดดะฮ์ และการดูแลนัฟเกาะฮ์ (ค่าใช้จ่ายหรือปัจจัยยังชีพ) ของฝ่ายหญิง ทั้งนี้เพื่อให้สิทธิและหน้าที่ของสามีและภรรยายังคงได้รับการรักษาและดำรงปฏิบัติอย่างครบถ้วนสมบูรณ์"
  },
  {
    "surah_id": "66",
    "name": "At-Tahrim",
    "reveal": "มะดะนิยะฮ์",
    "max_ayat": 12,
    "thematic_ayat": [
      {
        "ayat_range": "1-5",
        "theme": "ปัญหาที่เกิดขึ้นระหว่างท่านนบีกับภรรยาบางท่าน"
      },
      {
        "ayat_range": "6-8",
        "theme": "คำเรียกร้องถึงผู้ศรัทธาและผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "9",
        "theme": "คำเรียกร้องให้ท่านนบีทำการญิฮาดต่อผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "10-12",
        "theme": "ตัวอย่างผู้หญิงที่ปฏิเสธศรัทธาและผู้หญิงที่ศรัทธา"
      }
    ],
    "content_detail": "สูเราะฮ์นี้ถูกประทานลงมาเนื่องจากท่านนบีได้ห้ามตนเองจากทาสีของท่านที่ชื่อ “มาริยะฮ์ อัลกิบฏียะฮ์” และอีกรายงานหนึ่งบอกว่า ท่านนบีได้ห้ามตนเองจากการทานน้ำผึ้ง เพื่อเอาใจภรรยาบางคนของท่าน คือ ท่านหญิงฮัฟเศาะฮ์ และ ท่านหญิงอาอิชะฮ์ เราะฎิยัลลอฮุอันฮุมา ทั้ง ๆ ที่ทาสีและน้ำผึ้งเป็นสิ่งที่ได้รับอนุมัติ (หะลาล) ณ ที่อัลลอฮ์"
  },
  {
    "surah_id": "67",
    "name": "Al-Mulk",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 30,
    "thematic_ayat": [
      {
        "ayat_range": "1-5",
        "theme": "เดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "6-12",
        "theme": "บั้นปลายของผู้ปฏิเสธและการสำนึกผิดในบาปของตนเอง"
      },
      {
        "ayat_range": "13-15",
        "theme": "ความรู้และความโปรดปรานของอัลลอฮ์"
      },
      {
        "ayat_range": "16-22",
        "theme": "คำถามและการตำหนิต่อผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "23-27",
        "theme": "เดชานุภาพของอัลลอฮ์ในการสร้างสรรค์และฟื้นคืนชีพ"
      },
      {
        "ayat_range": "28-30",
        "theme": "ทางรอดจากการลงโทษและปัจจัยยังชีพทุกอย่างล้วนอยู่ในพระหัตถ์ของอัลลอฮ์"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "68",
    "name": "Al-Qolam",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 52,
    "thematic_ayat": [
      {
        "ayat_range": "1-7",
        "theme": "ท่านเราะซูลุลลอฮ์คือผู้มีคุณธรรมที่ยิ่งใหญ่"
      },
      {
        "ayat_range": "8-16",
        "theme": "ลักษณะของผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "17-34",
        "theme": "เรื่องราวของบรรดาเจ้าของสวน"
      },
      {
        "ayat_range": "35-47",
        "theme": "คำถามสำหรับคนชั่วและการขาดทุนของผู้ปฏิเสธ"
      },
      {
        "ayat_range": "48-52",
        "theme": "คำบัญชาให้ท่านนบีอดทน"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "69",
    "name": "Al-Haqqoh",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 52,
    "thematic_ayat": [
      {
        "ayat_range": "1-3",
        "theme": "วันสิ้นโลกเกิดขึ้นแน่นอน"
      },
      {
        "ayat_range": "4-12",
        "theme": "หายนะของผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "13-18",
        "theme": "สภาพของวันสิ้นโลก"
      },
      {
        "ayat_range": "19-37",
        "theme": "สภาพและการตอบแทนของผู้รับบันทึกจากด้านขวาและผู้รับบันทึกจากด้านซ้าย"
      },
      {
        "ayat_range": "38-52",
        "theme": "ความจริงเกี่ยวกับอัลกุรอาน"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "70",
    "name": "Al-Maarij",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 44,
    "thematic_ayat": [
      {
        "ayat_range": "1-18",
        "theme": "สภาพของวันสิ้นโลก"
      },
      {
        "ayat_range": "19-21",
        "theme": "พฤติกรรมของมนุษย์"
      },
      {
        "ayat_range": "22-35",
        "theme": "คุณลักษณะของผู้ศรัทธา"
      },
      {
        "ayat_range": "36-44",
        "theme": "การกระทำและผลตอบแทนของผู้ปฏิเสธศรัทธา"
      },
      {
        "ayat_range": "3",
        "theme": "ชื่อว่า “อัลมะอาริจญ์” หมายถึง ทางขึ้นไป ถูกกล่าวไว้ในอายะฮ์ที่ 3 ซึ่งนักตัฟซีรได้อธิบายไว้แตกต่างกัน บ้างบอกว่าหมายถึง ท้องฟ้า หรือ ความโปรดปราน หรือ ลำดับชั้นที่อัลลอฮ์จะทรงประทานให้แก่ชาวสวรรค์"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "71",
    "name": "Nuh",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 28,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "อัลลอฮ์ได้ส่งนบีนูหแก่กลุ่มชนของท่าน"
      },
      {
        "ayat_range": "5-12",
        "theme": "ความมานะอดทนของนบีนูหในการดะอฺวะฮ์"
      },
      {
        "ayat_range": "13-20",
        "theme": "นบีนูหกล่าวถึงเดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "21-28",
        "theme": "ความดื้อดึงของกลุ่มชนนบีนูหและดุอาอ์ของท่าน"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 71 มักกิยะฮ์ จำนวน 28 อายะฮ์"
  },
  {
    "surah_id": "72",
    "name": "Al-Jinn",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 28,
    "thematic_ayat": [
      {
        "ayat_range": "1-7",
        "theme": "กลุ่มญินที่ฟังอัลกุรอานจากท่านนบีมุฮัมมัด"
      },
      {
        "ayat_range": "8-17",
        "theme": "กลุ่มต่าง ๆ ของพวกญิน"
      },
      {
        "ayat_range": "18-24",
        "theme": "คำแนะนำแด่ท่านเราะสูล"
      },
      {
        "ayat_range": "25-28",
        "theme": "ไม่มีใครรู้เรื่องสิ่งเร้นลับนอกจากอัลลอฮ์"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 72 มักกิยะฮ์ จำนวน 28 อายะฮ์"
  },
  {
    "surah_id": "73",
    "name": "Al-Muzzammil",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 20,
    "thematic_ayat": [
      {
        "ayat_range": "1-10",
        "theme": "คำแนะนำแด่นบีผู้คลุมกาย"
      },
      {
        "ayat_range": "11-19",
        "theme": "คำเตือนสำหรับผู้ที่ปฏิเสธโลกหน้า"
      },
      {
        "ayat_range": "20",
        "theme": "คุณค่าของการละหมาดกลางคืนและคำแนะนำแก่ผู้ศรัทธา"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 73 มักกิยะฮ์ จำนวน 20 อายะฮ์"
  },
  {
    "surah_id": "74",
    "name": "Al-Muddathsir",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 56,
    "thematic_ayat": [
      {
        "ayat_range": "1-7",
        "theme": "คำแนะนำแด่ท่านนบีผู้ห่มกาย"
      },
      {
        "ayat_range": "8-10",
        "theme": "เตือนผู้ปฏิเสธศรัทธาด้วยสภาพของวันสิ้นโลก"
      },
      {
        "ayat_range": "11-26",
        "theme": "คำเตือนและคำสัญญาต่ออัลวะลีด บินอัลมุฆีเราะฮ์"
      },
      {
        "ayat_range": "27-37",
        "theme": "นรกและผู้เฝ้าดูแลมัน"
      },
      {
        "ayat_range": "38-53",
        "theme": "สาเหตุที่คนชั่วทั้งหลายถูกลงโทษในนรก"
      },
      {
        "ayat_range": "54-56",
        "theme": "ในอัลกุรอานมีข้อเตือนสติ"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 74 มักกิยะฮ์ จำนวน 56 อายะฮ์"
  },
  {
    "surah_id": "75",
    "name": "Al-Qiyamah",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 40,
    "thematic_ayat": [
      {
        "ayat_range": "1-15",
        "theme": "ยืนยันว่าวันกิยามะฮ์จะเกิดขึ้นจริงอย่างแน่นอน"
      },
      {
        "ayat_range": "16-19",
        "theme": "ท่านนบีถูกเตือนมิให้เร่งรีบในการอ่านและท่องจำอัลกุรอาน"
      },
      {
        "ayat_range": "20-40",
        "theme": "ความตาย ความคิด และสภาพของมนุษย์ในโลกหน้า"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 75 มักกิยะฮ์ จำนวน 40 อายะฮ์"
  },
  {
    "surah_id": "76",
    "name": "Al-Insan",
    "reveal": "มะดะนียะฮ์",
    "max_ayat": 31,
    "thematic_ayat": [
      {
        "ayat_range": "1-3",
        "theme": "มนุษย์กับ 2 ทางเลือก"
      },
      {
        "ayat_range": "4-22",
        "theme": "บทลงโทษสำหรับผู้ปฏิเสธศรัทธา และความโปรดปรานในโลกหน้าสำหรับคนดีมีคุณธรรม"
      },
      {
        "ayat_range": "23-31",
        "theme": "คำแนะนำแด่ท่านเราะสูลุลลอฮ์และผู้ศรัทธา"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 76 มะดะนียะฮ์ จำนวน 31 อายะฮ์"
  },
  {
    "surah_id": "77",
    "name": "Al-Mursalat",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 50,
    "thematic_ayat": [
      {
        "ayat_range": "1-14",
        "theme": "สภาพของวันกิยามะฮ์"
      },
      {
        "ayat_range": "15-28",
        "theme": "เตือนสำหรับผู้ปฏิเสธศรัทธาถึงความหายนะและเดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "29-40",
        "theme": "เตือนผู้ปฏิเสธศรัทธาด้วยสภาพของพวกเขาในโลกหน้า"
      },
      {
        "ayat_range": "41-50",
        "theme": "การตอบแทนสำหรับผู้ที่กระทำความดี และบั้นปลายของผู้ปฏิเสธศรัทธา"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 77 มักกิยะฮ์ จำนวน 50 อายะฮ์"
  },
  {
    "surah_id": "78",
    "name": "An-Naba",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 40,
    "thematic_ayat": [
      {
        "ayat_range": "1-5",
        "theme": "ยืนยันเรื่องการฟื้นคืนชีพ"
      },
      {
        "ayat_range": "6-16",
        "theme": "เดชานุภาพและความโปรดปรานของอัลลอฮ์"
      },
      {
        "ayat_range": "17-40",
        "theme": "สภาพของวันสิ้นโลกและการตอบแทนในโลกหน้า"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 78 มักกิยะฮ์ จำนวน 40 อายะฮ์"
  },
  {
    "surah_id": "79",
    "name": "An-Naziat",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 46,
    "thematic_ayat": [
      {
        "ayat_range": "1-14",
        "theme": "สภาพของวันกิยามะฮ์"
      },
      {
        "ayat_range": "15-26",
        "theme": "เรื่องราวของนบีมูซากับฟิรเอาน์"
      },
      {
        "ayat_range": "27-33",
        "theme": "เดชานุภาพของอัลลอฮ์"
      },
      {
        "ayat_range": "34-46",
        "theme": "เตือนสำทับเรื่องวันกิยามะฮ์"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 79 มักกิยะฮ์ จำนวน 46 อายะฮ์"
  },
  {
    "surah_id": "80",
    "name": "Abasa",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 42,
    "thematic_ayat": [
      {
        "ayat_range": "1-10",
        "theme": "อัลลอฮ์ทรงติเตียนท่านนบีเรื่องท่านอับดุลลอฮ์ บินอุมมิมักตูม"
      },
      {
        "ayat_range": "11-16",
        "theme": "ความสำคัญของอัลกุรอาน"
      },
      {
        "ayat_range": "17-32",
        "theme": "ความโปรดปรานของอัลลอฮ์แก่ปวงบ่าว"
      },
      {
        "ayat_range": "33-42",
        "theme": "สภาพและการตอบแทนในโลกหน้า"
      }
    ],
    "content_detail": "สูเราะฮ์ที่ 80 มักกิยะฮ์ จำนวน 42 อายะฮ์"
  },
  {
    "surah_id": "81",
    "name": "At-Takwir",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 29,
    "thematic_ayat": [{
        "ayat_range": "1-14",
        "theme": "เหตุการณ์อันน่าสะพรึงกลัวเมื่อวันกิยามะฮ์เกิดขึ้น: ดวงอาทิตย์ม้วนดับ, ดวงดาวร่วงหล่น, ภูเขาเคลื่อนพัง, อูฐท้องแก่ถูกทอดทิ้ง, สัตว์ป่าถูกต้อนมารวมกัน, ทะเลเดือดพล่าน, วิญญาณถูกจับคู่, เด็กหญิงที่ถูกฝังทั้งเป็นถูกถามถึงความผิด, บันทึกถูกกางแผ่, ท้องฟ้าถูกลอกออก, นรกถูกจุดไฟลุกโชน, สวรรค์ถูกนำมาใกล้ และทุกชีวิตจะได้รู้สิ่งที่ตนได้เตรียมไว้"
      },
      {
        "ayat_range": "15-25",
        "theme": "คำสาบานด้วยดวงดาวที่ซ่อนตัวและเคลื่อนที่, ยามค่ำคืนที่ย่างกราย และยามเช้าเมื่อทอแสง เพื่อยืนยันว่าอัลกุรอานคือถ้อยคำที่นำมาโดยทูตผู้ทรงเกียรติและมีพลัง (ญิบรีล) และสหายของพวกท่าน (นบีมุฮัมมัด) ไม่ได้เป็นบ้า"
      },
      {
        "ayat_range": "26-29",
        "theme": "มนุษย์จะหันหลังเดินไปทางใดเล่า? แท้จริงอัลกุรอานคือข้อเตือนใจแก่สากลโลก สำหรับผู้ที่ประสงค์จะดำเนินชีวิตบนความเที่ยงตรง ภายใต้พระประสงค์ของอัลลอฮ์พระผู้เป็นเจ้าแห่งสากลโลก"
      }],
    "content_detail": "“อัตตักวีร” หมายถึง การม้วนขึ้น หรือ การทำให้มืดดับ นำมาจากคำแรกของสูเราะฮ์ที่กล่าวถึงการม้วนดับของดวงอาทิตย์ สูเราะฮ์นี้วาดภาพเหตุการณ์วันสิ้นโลกได้อย่างชัดเจนและทรงพลังที่สุดบทหนึ่ง"
  },
  {
    "surah_id": "82",
    "name": "Al-Infithor",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 19,
    "thematic_ayat": [{
        "ayat_range": "1-5",
        "theme": "สภาพเมื่อฟากฟ้าแตกออก, ดวงดาวร่วงหล่นกระจัดกระจาย, ทะเลถูกเปิดทะลักถึงกัน, หลุมฝังศพถูกพลิกกลับ และทุกชีวิตจะได้รู้ถึงสิ่งที่ตนได้กระทำไว้ล่วงหน้าและล้าหลัง"
      },
      {
        "ayat_range": "6-12",
        "theme": "คำตักเตือนมนุษย์ผู้ทรยศ: สิ่งใดเล่าที่ล่อลวงเจ้าให้หันห่างจากพระเจ้าผู้ทรงกรุณาปรานี ผู้ทรงสร้างเจ้า ขัดเกลาเจ้า และทรงประกอบร่างของเจ้าตามประสงค์? ทว่าพวกเจ้ากลับปฏิเสธวันตอบแทน ทั้งที่มีมะลาอิกะฮ์ผู้ทรงเกียรติคอยบันทึกและรับรู้ทุกสิ่งที่พวกเจ้ากระทำ"
      },
      {
        "ayat_range": "13-19",
        "theme": "บั้นปลายความเกษมสำราญของบรรดาผู้ทำความดีในสวนสวรรค์ เทียบกับบั้นปลายอันทุกข์ทรมานของผู้ทำชั่วในนรกที่พวกเขาไม่อาจหนีพ้น และความจริงของวันแห่งการตัดสิน วันที่ไม่มีชีวิตใดมีอำนาจช่วยชีวิตใดได้ และอำนาจทั้งสิ้นในวันนั้นเป็นสิทธิของอัลลอฮ์"
      }],
    "content_detail": "“อัลอินฟิฏอร” หมายถึง การแตกออก นำมาจากอายะฮ์แรกของสูเราะฮ์ มีเนื้อหาเกี่ยวเนื่องและคล้ายคลึงกับสูเราะฮ์อัตตักวีร โดยเน้นย้ำถึงสัจธรรมของวันกิยามะฮ์และการบันทึกความดีความชั่วของมนุษย์"
  },
  {
    "surah_id": "83",
    "name": "Al-Muthoffifin",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 36,
    "thematic_ayat": [{
        "ayat_range": "1-6",
        "theme": "ความวิบัติจงประสบแด่ผู้โกงตวง-ชั่ง ที่ตวงเอาจากคนอื่นเต็มเปี่ยมแต่เวลาตวงชั่งให้คนอื่นกลับทำให้ขาดพร่อง พวกเขาไม่คิดหรือว่าจะต้องถูกชุบชีวิตขึ้นมาในวันอันยิ่งใหญ่?"
      },
      {
        "ayat_range": "7-17",
        "theme": "บันทึกของผู้ทำชั่วถูกเก็บไว้ใน 'สิจญีน' (ที่อันต่ำต้อยและแคบ) ความวิบัติแก่ผู้โกงและปฏิเสธวันตอบแทน ที่หัวใจของพวกเขาเกิดสนิมเกาะเนื่องจากบาปที่ขวนขวายไว้ จนถูกปิดกั้นจากการมองเห็นพระเจ้าและต้องเข้าสู่นรก"
      },
      {
        "ayat_range": "18-28",
        "theme": "บันทึกของผู้ทำความดีถูกเก็บไว้ใน 'อิลลิยูน' (ที่อันสูงส่ง) รางวัลของพวกเขาคือความบรมสุขบนเบาะนั่งอันงดงาม ได้ดื่มสุราบริสุทธิ์ที่ถูกประทับตราไว้ด้วยชะมดเชียงผสมกับน้ำจากตาน้ำตัสนีม"
      },
      {
        "ayat_range": "29-36",
        "theme": "ภาพสะท้อนพฤติกรรมในดุนยา: พวกผู้ทำผิดเคยหัวเราะเยาะและหลิ่วตาขยิบตาใส่ผู้ศรัทธา แต่ในวันปรโลก บรรดาผู้ศรัทธาจะเป็นฝ่ายหัวเราะเยาะพวกผู้ปฏิเสธศรัทธาคืนบ้างขณะอยู่บนเบาะนั่งอันหรูหรา"
      }],
    "content_detail": "“อัลมุฏ็อฟฟิฟีน” หมายถึง บรรดาผู้โกงการตวงและชั่งน้ำหนัก นำมาจากอายะฮ์แรก เป็นสูเราะฮ์ที่เชื่อมโยงระหว่างมารยาทและจริยธรรมทางเศรษฐกิจการค้าเข้ากับความศรัทธาต่อวันปรโลกอย่างแนบแน่น"
  },
  {
    "surah_id": "84",
    "name": "Al-Insyiqoq",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 25,
    "thematic_ayat": [{
        "ayat_range": "1-5",
        "theme": "สภาพเมื่อฟากฟ้าแตกแหลกและเชื่อฟังพระบัญชาของพระเจ้า และเมื่อแผ่นดินถูกแผ่ขยาย ขับสิ่งที่อยู่ภายในออกมาจนหมดสิ้นและยอมนอบน้อมต่อพระผู้เป็นเจ้า"
      },
      {
        "ayat_range": "6-15",
        "theme": "มนุษย์เอ๋ย! แท้จริงเจ้าต้องพากเพียรไปสู่พระเจ้าของเจ้าอย่างเหน็ดเหนื่อยแล้วจึงจะพบพระองค์ ผู้ที่ได้รับบันทึกด้วย 'มือขวา' จะถูกสอบสวนอย่างง่ายดายและกลับไปหาครอบครัวด้วยความยินดี ส่วนผู้ที่ได้รับบันทึกไว้ทาง 'เบื้องหลัง' จะร้องเรียกความพินาศและเข้าสู่นรก เนื่องจากในโลกดุนยาเคยระเริงและคิดว่าจะไม่มีวันกลับคืนสู่พระองค์"
      },
      {
        "ayat_range": "16-19",
        "theme": "คำสาบานด้วยแสงสายัณห์, ยามค่ำคืนและสิ่งที่มันรวบรวมไว้ และดวงจันทร์เมื่อมันเต็มดวง เพื่อยืนยันว่ามนุษย์จะต้องเผชิญและเปลี่ยนผ่านสภาพหนึ่งไปสู่อีกสภาพหนึ่ง (จากดุนยา สู่อาลัมบัรซัค และวันกิยามะฮ์)"
      },
      {
        "ayat_range": "20-25",
        "theme": "เหตุใดพวกเขาจึงไม่ศรัทธาและไม่ยอมสุญูดเมื่ออัลกุรอานถูกอ่าน? ทว่าพวกปฏิเสธกลับมุสา แต่อัลลอฮ์ทรงรู้สิ่งที่พวกเขาซ่อนไว้ แจ้งข่าวบทลงโทษอันเจ็บปวดแก่พวกเขา เว้นแต่บรรดาผู้ศรัทธาและทำความดีที่จะได้รับรางวัลอันไม่มีวันสิ้นสุด"
      }],
    "content_detail": "“อัลอินชิกอก” หมายถึง การแตกแยกออก นำมาจากอายะฮ์แรก สูเราะฮ์นี้มีอายะฮ์อัสสัจดะฮ์ในอายะฮ์ที่ 21 ซึ่งส่งเสริมให้ผู้สวดอ่านและผู้ฟังทำการก้มกราบสุญูดเพื่อแสดงความนอบน้อมต่อพระเจ้า"
  },
  {
    "surah_id": "85",
    "name": "Al-Buruj",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 22,
    "thematic_ayat": [{
        "ayat_range": "1-3",
        "theme": "คำสาบานด้วยฟากฟ้าที่มีจักรราศี (ดวงดาวก้อนใหญ่), วันที่ถูกสัญญาไว้ (วันกิยามะฮ์) และผู้เป็นพยานรวมถึงสิ่งที่ถูกเป็นพยาน"
      },
      {
        "ayat_range": "4-11",
        "theme": "เรื่องราวประวัติศาสตร์ของ 'ชาวร่องกุม' (อัศฮาบุลอุคดูด) กษัตริย์ทรราชที่ขุดร่องจุดไฟเผาบรรดาผู้ศรัทธาทั้งเป็นเพียงเพราะพวกเขาศรัทธาต่ออัลลอฮ์ คำขู่สำทับบทลงโทษในนรกแก่ผู้ทำร้ายมุอ์มิน และสัญญาญสวรรค์สำหรับผู้ยืนหยัดศรัทธา"
      },
      {
        "ayat_range": "12-16",
        "theme": "แท้จริงการลงทัณฑ์ของพระเจ้านั้นรุนแรงยิ่ง พระองค์คือผู้ทรงเริ่มสร้างและทรงให้ฟื้นคืนชีวิต ทรงเป็นผู้ให้อภัย ผู้ทรงรักปวงบ่าว ผู้ทรงเป็นเจ้าของบัลลังก์อันรุ่งโรจน์ และผู้ทรงทำตามครรลองที่ทรงประสงค์"
      },
      {
        "ayat_range": "17-22",
        "theme": "เรื่องราวอุทาหรณ์ของพลพรรคฟิรเอาน์และษะมูด แต่อัลลอฮ์ทรงล้อมพวกปฏิเสธไว้จากเบื้องหลัง และย้ำว่าอัลกุรอานนั้นรุ่งโรจน์ยิ่ง ถูกรักษาไว้ในแผ่นจารึกที่ปลอดภัย (เลาฮิลมะห์ฟูซ)"
      }],
    "content_detail": "“อัลบุรูจญ์” หมายถึง กลุ่มดวงดาว หรือ กลุ่มจักรราศี นำมาจากอายะฮ์แรก เนื้อหาหลักปลุกปลอบใจผู้ศรัทธาที่ถูกรังแกในมักกะฮ์ด้วยเรื่องราวความยืนหยัดของชนรุ่นก่อนที่ยอมสละชีวิตเพื่อรักษาความศรัทธา"
  },
  {
    "surah_id": "86",
    "name": "At-Toriq",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 17,
    "thematic_ayat": [{
        "ayat_range": "1-4",
        "theme": "คำสาบานด้วยฟากฟ้าและผู้มาเยือนในยามค่ำคืน ซึ่งก็คือดวงดาวที่ส่องแสงเจิดจ้า ยืนยันว่าไม่มีชีวิตใดที่ไม่มีผู้คอยปกป้องรักษา (มะลาอิกะฮ์)"
      },
      {
        "ayat_range": "5-10",
        "theme": "มนุษย์จงพิจารณาเถิดว่าถูกสร้างมาจากสิ่งใด? ถูกสร้างมาจากน้ำที่พุ่งออกมาจากระหว่างกระดูกสันหลังของชายและกระดูกหน้าอกของหญิง แท้จริงพระองค์ย่อมทรงสามารถนำเขากลับมาฟื้นคืนชีพได้อีกครั้ง ในวันที่สิ่งเร้นลับและความในใจจะถูกเปิดเผย โดยที่มนุษย์ไม่มีกำลังหรือผู้ช่วยเหลือใด ๆ"
      },
      {
        "ayat_range": "11-14",
        "theme": "คำสาบานด้วยฟากฟ้าที่หลั่งน้ำฝนลงมาเป็นวัฏจักร และแผ่นดินที่แยกออกให้พืชพรรณเติบโต เพื่อยืนยันว่าอัลกุรอานคือพระวจนะที่แยกแยะสัจธรรมกับความเท็จ และไม่ใช่เรื่องล้อเล่น"
      },
      {
        "ayat_range": "15-17",
        "theme": "พวกปฏิเสธศรัทธากำลังวางอุบายอย่างแยบยล และพระองค์ก็ทรงวางอุบายตอบโต้อย่างเด็ดขาด ดังนั้นจงผ่อนปรนให้พวกปฏิเสธศรัทธาเหล่านั้นเถิด และปล่อยพวกเขารอคอยไปอีกสักระยะหนึ่ง"
      }],
    "content_detail": "“อัฏฏอริก” หมายถึง ผู้มาเยือนยามค่ำคืน หรือ ดวงดาวที่ปรากฏเด่นชัดในความมืด นำมาจากคำแรกของสูเราะฮ์ เป็นบทสั้น ๆ ที่ชี้หลักฐานจากการก่อกำเนิดของมนุษย์และธรรมชาติเพื่อพิสูจน์เรื่องการคืนชีพ"
  },
  {
    "surah_id": "87",
    "name": "Al-Ala",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 19,
    "thematic_ayat": [
      {
        "ayat_range": "1-5",
        "theme": "คำสั่งให้แซ่ซ้องสดุดีพระนามอันสูงสุดของพระเจ้า ผู้ทรงสร้างและทรงทำให้สมบูรณ์ ผู้ทรงกำหนดสัดส่วนและชี้แนะแนวทาง และผู้ทรงทำให้ทุ่งหญ้างอกงามแล้วทำให้กลายเป็นเศษหญ้าแห้งสีดำ"
      },
      {
        "ayat_range": "6-7",
        "theme": "สัญญาจากอัลลอฮ์ว่าจะทรงสอนอัลกุรอานให้แก่ท่านนบีโดยที่ท่านจะไม่ลืม เว้นแต่สิ่งที่อัลลอฮ์ทรงประสงค์ แท้จริงพระองค์ทรงรู้สิ่งเปิดเผยและสิ่งเร้นลับ"
      },
      {
        "ayat_range": "8-13",
        "theme": "พระองค์จะทรงให้ท่านได้รับความสะดวกสบายในแนวทางที่ง่ายดาย ดังนั้นจงตักเตือนเถิดหากการตักเตือนนั้นให้คุณประโยชน์ ผู้ที่เกรงกลัวจะรับข้อเตือนใจ ส่วนผู้ที่ชั่วช้าจะผินหลังหนี ซึ่งบั้นปลายของเขาคือการเข้าสู่ไฟนรกอันโชติช่วง โดยที่เขาจะไม่ตายและไม่เป็นอยู่ในนั้น"
      },
      {
        "ayat_range": "14-19",
        "theme": "ผู้ที่ขัดเกลาตนเอง ดำรงละหมาดและรำลึกถึงพระเจ้าจะประสบความสำเร็จ ทว่าพวกเจ้ายลือกชีวิตดุนยา ทั้งที่อาคิเราะฮ์นั้นดีกว่าและยั่งยืนกว่า แท้จริงสัจธรรมข้อนี้มีบันทึกไว้ในคัมภีร์ยุคก่อน ๆ คือคัมภีร์ของอิบรอฮีมและมูซา"
      }
    ],
    "content_detail": "“อัลอะอ์ลา” หมายถึง พระผู้ทรงสูงสุด นำมาจากอายะฮ์แรก เป็นสูเราะฮ์ที่ท่านเราะซูลุลลอฮ์ทรงโปรดปรานและมักจะใช้อ่านบ่อยครั้งในการละหมาดวันศุกร์ (ญุมุอะฮ์) และการละหมาดวันอีดทั้งสอง"
  },
  {
    "surah_id": "88",
    "name": "Al-Ghosiyah",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 26,
    "thematic_ayat": [{
        "ayat_range": "1-7",
        "theme": "เรื่องราวของวันแห่งการครอบงำ (วันกิยามะฮ์) สภาพใบหน้าที่เศร้าหมองเหน็ดเหนื่อยของชาวนรก ต้องเข้าสู่ไฟอันร้อนจัด ได้ดื่มน้ำจากตาน้ำที่เดือดพล่าน และไม่มีอาหารใด ๆ นอกจากพืชหนามที่ไร้ประโยชน์และไม่คลายความหิว"
      },
      {
        "ayat_range": "8-16",
        "theme": "สภาพใบหน้าที่เบิกบานอิ่มเอิบของชาวสวรรค์ พอใจในความเพียรพยายามของตน อยู่ในสวนสวรรค์อันสูงส่งที่ไม่ได้ยินวาจาไร้สาระ มีตาน้ำพุพวยพุ่ง มีเตียงนอนสูงตระหง่าน มีแก้วน้ำถูกจัดวางไว้ มีหมอนอิงเรียงราย และมีพรมปูลาดอย่างงดงาม"
      },
      {
        "ayat_range": "17-20",
        "theme": "หลักฐานชี้ชวนให้มนุษย์คิดพิจารณา: พวกเขาไม่มองดูอูฐดอกหรือว่าถูกสร้างมาอย่างไร? มองดูฟากฟ้าว่าถูกยกสูงอย่างไร? มองดูภูเขาว่าถูกตั้งตอกหมุดอย่างไร? และมองดูแผ่นดินว่าถูกปูแผ่ขยายอย่างไร?"
      },
      {
        "ayat_range": "21-26",
        "theme": "หน้าที่ของท่านนบีคือการตักเตือนเท่านั้น ท่านไม่ใช่ผู้มีอำนาจไปบังคับควบคุมพวกเขา ส่วนผู้ที่ผินหลังและปฏิเสธ อัลลอฮ์จะทรงลงทัณฑ์เขาด้วยการลงโทษอันยิ่งใหญ่ แท้จริงการกลับคืนสู่พระองค์คือเป้าหมายของพวกเขา และหน้าที่ในการชำระบัญชีเป็นของพระองค์"
      }],
    "content_detail": "“อัลฆอชิยะฮ์” หมายถึง สิ่งที่เข้ามาครอบงำ ซึ่งหมายถึงวันกิยามะฮ์ที่ภัยพิบัติของมันจะแผ่คลุมทุกสรรพสิ่ง สูเราะฮ์นี้แบ่งโครงสร้างเนื้อหาออกเป็นสามส่วนอย่างชัดเจน คือ สภาพนรก สภาพสวรรค์ และสิ่งสร้างในธรรมชาติ"
  },
  {
    "surah_id": "89",
    "name": "Al-Fajr",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 30,
    "thematic_ayat": [{
        "ayat_range": "1-5",
        "theme": "คำสาบานด้วยยามรุ่งอรุณ, ค่ำคืนทั้งสิบ (สิบคืนแรกของเดือนซุลฮิจญะฮ์), สิ่งที่เป็นคู่และสิ่งที่เป็นคี่ และยามค่ำคืนเมื่อมันโคจรไป เพื่อเป็นข้อพิสูจน์อันยิ่งใหญ่สำหรับผู้มีสติปัญญา"
      },
      {
        "ayat_range": "6-14",
        "theme": "อุทาหรณ์จากความพินาศของกลุ่มชนผู้ล่วงละเมิดในอดีต: ชาวอาดแห่งนครอิร็อมที่มีเสาหินสูงตระหง่าน, ชาวษะมูดผู้สกัดหินในหุบเขา และฟิรเอาน์ผู้เป็นเจ้าของกองทัพตอกหมุด พวกเขาต่างก่อความเสียหายบนหน้าแผ่นดิน จนพระเจ้าทรงหลั่งแส้แห่งการลงทัณฑ์ใส่ แท้จริงพระเจ้าของเจ้านั้นทรงเฝ้ามองอยู่เสมอ"
      },
      {
        "ayat_range": "15-20",
        "theme": "ธรรมชาติของมนุษย์เมื่อพระเจ้าทรงทดสอบด้วยความมีเกียรติและริซกีอันกว้างขวางก็กล่าวว่าพระองค์ทรงยกย่องฉัน แต่เมื่อทดสอบด้วยความคับแค้นก็ตัดพ้อว่าพระองค์ทรงเหยียดหยามฉัน ทว่าพวกเจ้ากลับไม่เกื้อกูลเด็กกำพร้า ไม่ชวนกันให้อาหารคนยากจน กินมรดกอย่างตะกละ และรักทรัพย์สินอย่างล้นพ้น"
      },
      {
        "ayat_range": "21-26",
        "theme": "วันที่แผ่นดินถูกบดขยี้ วันที่พระเจ้าเสด็จมาพร้อมมะลาอิกะฮ์ที่ยืนเรียงแถว และนรกญะฮันนัมถูกนำมาปรากฏ ในวันนั้นมนุษย์จะรำลึกได้แต่สายเสียแล้ว เขาจะร้องว่า 'อุทาน! หากฉันได้ทำความดีเตรียมไว้สำหรับชีวิตนี้ก็ดี' ซึ่งการลงโทษในวันนั้นไม่มีใครลงทัณฑ์ได้รุนแรงเท่าพระองค์"
      },
      {
        "ayat_range": "27-30",
        "theme": "เสียงเรียกอันเปี่ยมสุขแก่ผู้ศรัทธา: 'โอ้ชีวิตที่สงบนิ่งเอ๋ย! จงกลับคืนสู่พระเจ้าของเจ้าในสภาพที่พึงพอใจและเป็นที่พึงพอพระทัยเถิด จงเข้ามาอยู่ในหมู่บ่าวของฉัน และจงเข้ามาอยู่ในสวนสวรรค์ของฉัน'"
      }],
    "content_detail": "“อัลฟัจญ์รฺ” หมายถึง ยามรุ่งอรุณ นำมาจากคำแรกของสูเราะฮ์ มีจุดเด่นคือวรรคตอนท้ายสุด (อายะฮ์ที่ 27-30) ที่อธิบายถึงสภาพจิตใจอันสงบมั่น (อันนัฟซุลมุฏมะอินนะฮ์) ของมุอ์มินที่ได้รับการต้อนรับสู่สวรรค์"
  },
  {
    "surah_id": "90",
    "name": "Al-Balad",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 20,
    "thematic_ayat": [{
        "ayat_range": "1-4",
        "theme": "คำสาบานด้วยเมืองนี้ (นครมักกะฮ์อันศักดิ์สิทธิ์) ขณะที่ท่านนบีพำนักอยู่ และสาบานด้วยผู้ให้กำเนิดและสิ่งที่ถูกให้กำเนิด เพื่อยืนยันว่าเราได้สร้างมนุษย์มาให้อยู่ในความยากลำบากและตรากตรำ"
      },
      {
        "ayat_range": "5-7",
        "theme": "มนุษย์คิดหรือว่าไม่มีใครมีอำนาจเหนือเขา? เขาโอ้อวดว่าได้ผลาญทรัพย์สินไปมากมาย เขาคิดหรือว่าไม่มีใครเห็นสิ่งที่เขาทำ?"
      },
      {
        "ayat_range": "8-10",
        "theme": "เรามิได้สร้างตาคู่หนึ่ง ลิ้นและริมฝีปากคู่หนึ่งให้แก่เขาดอกหรือ? และเราได้ชี้แนะแนวทางอันเด่นชัดทั้งสอง (ความดีและความชั่ว) ให้แก่เขาแล้ว"
      },
      {
        "ayat_range": "11-16",
        "theme": "ทว่าเขาไม่ยอมข้ามทางผ่านอันยากลำบาก และเจ้ารู้ไหมว่าทางผ่านอันยากลำบากนั้นคืออะไร? มันคือการไถ่ทาสให้เป็นอิสระ หรือการให้อาหารในวันแห่งความหิวโหยแก่เด็กกำพร้าที่เป็นญาติใกล้ชิด หรือแก่คนยากจนที่ขัดสนซบลงกับพื้นดิน"
      },
      {
        "ayat_range": "17-20",
        "theme": "จากนั้นเขาต้องเป็นผู้หนึ่งในบรรดาผู้ศรัทธา ตักเตือนกันให้มีความอดทน และตักเตือนกันให้มีความเมตตากรุณา คนเหล่านี้คือ 'กลุ่มข้างขวา' (ผู้ได้รับชัยชนะ) ส่วนบรรดาผู้ปฏิเสธศรัทธาต่อสัญญาณของเรา พวกเขาคือ 'กลุ่มข้างซ้าย' ซึ่งมีไฟนรกอันมิดชิดครอบงำปิดล้อมพวกเขาไว้"
      }],
    "content_detail": "“อัลบะลัด” หมายถึง เมือง หรือ นคร (ซึ่งหมายถึงมักกะฮ์) เป็นสูเราะฮ์ที่สอนให้มนุษย์ตระหนักถึงสัจธรรมของชีวิตที่ต้องผ่านอุปสรรค และชี้ทางรอดด้วยการทำความดีเพื่อสังคม เช่น การช่วยเหลือผู้ยากไร้และทาส ควบคู่ไปกับความศรัทธา"
  },
  {
    "surah_id": "91",
    "name": "Asy-Syam",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 15,
    "thematic_ayat": [{
        "ayat_range": "1-10",
        "theme": "คำสาบานอันยิ่งใหญ่ต่อเนื่องกัน 7 ประการในธรรมชาติ: ดวงอาทิตย์และแสงแดด, ดวงจันทร์เมื่อโคจรตามมา, กลางวันเมื่อทอแสงเจิดจ้า, กลางคืนเมื่อเข้าปกคลุม, ฟากฟ้าและการสร้างมัน, แผ่นดินและการแผ่ขยายมัน และชีวิต (จิตใจ) มนุษย์และการขัดเกลาจิตใจที่พระองค์ทรงดลใจให้รู้ทั้งความชั่วและความดี ยืนยันว่าผู้ที่ขัดเกลาจิตใจย่อมประสบความสำเร็จ ส่วนผู้ที่ปล่อยให้มันหมกมุ่นในบาปย่อมล้มเหลว"
      },
      {
        "ayat_range": "11-15",
        "theme": "อุทาหรณ์จากความพินาศของชาวษะมูดที่ปฏิเสธศรัทธาด้วยความล่วงละเมิด เมื่อผู้ที่ชั่วช้าที่สุดของพวกเขาลุกขึ้นไปฆ่าอูฐตัวเมียที่เป็นสัญญาณของอัลลอฮ์ แม้ว่าเราะซูล (นบีศอเลียะห์) จะเตือนแล้วก็ตาม บั้นปลายคือพระเจ้าทรงทำลายล้างพวกเขาจนราบพนาสูญเนื่องจากความผิดของพวกเขา และพระองค์ไม่ทรงเกรงกลัวผลลัพธ์ใด ๆ ตามมา"
      }],
    "content_detail": "“อัชชัมส์” หมายถึง ดวงอาทิตย์ นำมาจากคำแรกของสูเราะฮ์ ถือเป็นบทที่มีการสาบานด้วยสิ่งสร้างในธรรมชาติยาวนานที่สุดในอัลกุรอาน เพื่อเน้นย้ำถึงความสำคัญของการบริหารและการขัดเกลาจิตใจของมนุษย์"
  },
  {
    "surah_id": "92",
    "name": "Al-Lail",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 21,
    "thematic_ayat": [{
        "ayat_range": "1-4",
        "theme": "คำสาบานด้วยยามค่ำคืนเมื่อมันปกคลุม, ยามกลางวันเมื่อทอแสงเจิดจ้า และการสร้างเพศชายและเพศหญิง ยืนยันว่าแท้จริงการงานและการขวนขวายของพวกเจ้านั้นแตกต่างกันอย่างสิ้นเชิง"
      },
      {
        "ayat_range": "5-11",
        "theme": "เส้นทางชีวิตสองแบบ: ผู้ที่บริจาคทาน ยำเกรงพระเจ้า และเชื่อมั่นในสิ่งที่ดีงาม (สวรรค์) พระองค์จะทรงอำนวยความสะดวกให้เขาเข้าสู่ทางที่ง่ายดาย ส่วนผู้ที่ตระหนี่ถี่เหนียว คิดว่าตนเองร่ำรวยพอแล้ว และปฏิเสธสิ่งที่ดีงาม พระองค์จะทรงปล่อยให้เขาเดินไปสู่ทางที่ยากลำบาก (ความพินาศ) และทรัพย์สินจะไม่ช่วยอะไรเขาเลยเมื่อตกลงสู่นรก"
      },
      {
        "ayat_range": "12-21",
        "theme": "หน้าที่ของพระองค์คือการชี้แนะทางนำ และเป็นสิทธิของพระองค์ทั้งโลกนี้และโลกหน้า คำเตือนถึงไฟนรกที่ลุกโชนซึ่งจะไม่มีใครเข้ามันนอกจากผู้ชั่วช้าที่สุดที่ปฏิเสธและหันหลังให้ และผู้ที่ยำเกรงที่สุดจะรอดพ้นจากมัน คือผู้ที่บริจาคทรัพย์สินเพื่อขัดเกลาตนเอง โดยไม่หวังสิ่งตอบแทนจากใคร นอกจากเพื่อแสวงหาความโปรดปรานจากพระเจ้าผู้ทรงสูงสุด และในที่สุดเขาจะได้รับความพึงพอใจ"
      }],
    "content_detail": "“อัลลัยล์” หมายถึง กลางคืน นำมาจากคำแรกของสูเราะฮ์ มีโครงสร้างเนื้อหาที่เปรียบเทียบกันเป็นคู่ ๆ อย่างชัดเจน เช่น กลางคืน-กลางวัน, ชาย-หญิง, ผู้บริาค-ผู้ตระหนี่ และทางง่าย-ทางยาก เพื่อให้มนุษย์เลือกวิถีชีวิต"
  },
  {
    "surah_id": "93",
    "name": "Ad-Dhuha",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 11,
    "thematic_ayat": [{
        "ayat_range": "1-3",
        "theme": "คำสาบานด้วยยามสาย (แสงแดดอบอุ่น) และยามค่ำคืนเมื่อมันเงียบสงัด เพื่อปลอบใจและยืนยันแก่ท่านนบีว่า พระเจ้าของท่านมิได้ทรงทอดทิ้งท่านและมิได้ทรงโกรธเคืองท่านเลย (หลังจากที่วะหฺยูขาดช่วงไปชั่วระยะหนึ่ง)"
      },
      {
        "ayat_range": "4-5",
        "theme": "สัญญาอันยิ่งใหญ่ว่าชีวิตในปรโลกย่อมดีกว่าชีวิตในโลกนี้สำหรับท่าน และไม่ช้าพระเจ้าของท่านจะประทานรางวัลแก่ท่านจนท่านพึงพอใจ"
      },
      {
        "ayat_range": "6-8",
        "theme": "การทบทวนพระมหากรุณาธิคุณในอดีตที่พระองค์ทรงดูแลท่านนบี: พระองค์มิได้ทรงพบว่าเจ้าเป็นเด็กกำพร้าแล้วทรงให้ที่พึ่งพิงดอกหรือ? ทรงพบว่าเจ้าไม่รู้ทางแล้วทรงชี้แนะทางนำดอกหรือ? และทรงพบว่าเจ้าขัดสนแล้วทรงให้ความร่ำรวยดอกหรือ?"
      },
      {
        "ayat_range": "9-11",
        "theme": "ข้อปฏิบัติและจริยธรรมที่ต้องปฏิบัติตอบแทน: ดังกล่าวสำหรับเด็กกำพร้าเจ้าอย่าข่มเหง, สำหรับผู้เอ่ยปากขอเจ้าอย่าขับไล่ไสส่ง และสำหรับความโปรดปรานแห่งพระเจ้าของเจ้า เจ้าจงประกาศและเผยแผ่เถิด"
      }],
    "content_detail": "“อัดฎุฮา” หมายถึง ยามสาย หรือ ช่วงเวลาที่ดวงอาทิตย์ขึ้นสูง เป็นสูเราะฮ์ที่ประทานลงมาเพื่อเยียวยาจิตใจของท่านเราะซูลุลลอฮ์ ศ็อลลัลลอฮุอะลัยฮิวะสัลลัม ในยามที่ถูกพวกมุชริกีนล้อเลียน และเป็นบทที่ให้ความหวังและพลังใจแก่ผู้ศรัทธาอย่างมาก"
  },
  {
    "surah_id": "94",
    "name": "Asy-Syarh",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 8,
    "thematic_ayat": [{
        "ayat_range": "1-4",
        "theme": "การเปิดอกและยกฐานะของท่านนบี: เรามิได้เปิดอกของเจ้าให้แก่เจ้าดอกหรือ? และเราได้ปลดเปลื้องภาระหนักออกจากเจ้า ซึ่งเป็นภาระที่กดทับหลังของเจ้า และเราได้ยกย่องเกียรติของเจ้าให้แก่เจ้าแล้ว"
      },
      {
        "ayat_range": "5-6",
        "theme": "กฎแห่งความจริงใจและการปลอบประโลมที่ถูกกล่าวซ้ำด้วยความมั่นใจ: แท้จริงพร้อมกับความยากลำบากนั้นย่อมมีความง่ายดาย แท้จริงพร้อมกับความยากลำบากนั้นย่อมมีความง่ายดาย"
      },
      {
        "ayat_range": "7-8",
        "theme": "คำแนะนำในการดำเนินชีวิต: ดังนั้นเมื่อเจ้าเสร็จสิ้นจากภารกิจหนึ่งแล้ว ก็จงพากเพียรในภารกิจต่อไป และยังพระเจ้าของเจ้าเท่านั้นเจ้าจงมุ่งปรารถนา"
      }],
    "content_detail": "“อัชชัรห์” หมายถึง การเปิดอก มีอีกชื่อหนึ่งว่า 'อัลอินชิรอห์' ถือเป็นสูเราะฮ์คู่แฝดที่ต่อเนื่องมาจากสูเราะฮ์อัดฎุฮา เน้นเรื่องการขจัดความทุกข์ใจ การสร้างความมั่นใจในการทำงาน และการจัดสรรเวลาเมื่อเสร็จสิ้นภารกิจหนึ่งให้เริ่มงานต่อไปทันที"
  },
  {
    "surah_id": "95",
    "name": "At-Tin",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 8,
    "thematic_ayat": [{
        "ayat_range": "1-3",
        "theme": "คำสาบานด้วยสถานที่ศักดิ์สิทธิ์และแฝงสัญลักษณ์ของบรรดาศาสดาอันยิ่งใหญ่: มะเดื่อและมะกอก (แผ่นดินชาม/ปาเลสไตน์-นบีอีซา), ภูเขาฏูรในซีนาย (นบีมูซา) และเมืองอันปลอดภัยนี้ (มักกะฮ์-นบีมุฮัมมัด)"
      },
      {
        "ayat_range": "4-6",
        "theme": "แท้จริงเราได้สร้างมนุษย์มาในรูปแบบที่สวยงามและสมบูรณ์ยิ่ง แล้วเราได้หล่อหลอมบั้นปลายของเขาให้ตกต่ำที่สุดในนรก เว้นแต่บรรดาผู้ศรัทธาและทำความดีที่จะได้รับรางวัลตอบแทนอันไม่มีวันสิ้นสุด"
      },
      {
        "ayat_range": "7-8",
        "theme": "อะไรเล่าหลังจากนี้ที่ทำให้เจ้าปฏิเสธวันตอบแทน? อัลลอฮ์มิใช่ผู้ทรงตัดสินที่เที่ยงธรรมที่สุดในหมู่ผู้ตัดสินทั้งหลายดอกหรือ?"
      }],
    "content_detail": "“อัตตีน” หมายถึง มะเดื่อ นำมาจากคำแรกของสูเราะฮ์ เป็นบทที่ชี้ให้เห็นถึงเกียรติยศและศักดิ์ศรีดั้งเดิมของมนุษย์ที่ถูกสร้างมาอย่างประเสริฐที่สุด แต่จะตกต่ำลงหากไร้ซึ่งความศรัทธาและการทำความดี"
  },
  {
    "surah_id": "96",
    "name": "Al-Alaq",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 19,
    "thematic_ayat": [{
        "ayat_range": "1-5",
        "theme": "จุดเริ่มต้นแห่งแสงสว่าง (วะหฺยู 5 อายะฮ์แรกที่ถ้ำหิรออ์): คำสั่งให้สวดอ่านด้วยพระนามแห่งพระเจ้าผู้ทรงสร้าง ทรงสร้างมนุษย์มาจากก้อนเลือด จงอ่านเถิดและพระเจ้าของเจ้านั้นทรงกรุณายิ่ง ผู้ทรงสอนมนุษย์ด้วยปากกา ทรงสอนมนุษย์ในสิ่งที่เขาไม่รู้"
      },
      {
        "ayat_range": "6-14",
        "theme": "พฤติกรรมอันโอหังของมนุษย์ (อบูญะฮัล) เมื่อคิดว่าตนเองร่ำรวยและพอกำลัง ทั้งที่การกลับคืนสู่พระเจ้าคือสัจธรรม พฤติกรรมที่ขัดขวางและห้ามปรามบ่าวคนหนึ่ง (ท่านนบี) เมื่อกำลังละหมาด ชวนให้คิดว่าหากบ่าวคนนั้นอยู่บนทางนำแต่ผู้ห้ามกลับปฏิเสธและหันหลังให้ เขาไม่รู้หรือว่าอัลลอฮ์ทรงเห็น?"
      },
      {
        "ayat_range": "15-19",
        "theme": "คำคาดโทษอันเด็ดขาด: หากเขายังไม่หยุดยั้ง เราจะจิกเขาที่กระจุกผมหน้าผากอันโกหกและชั่วช้า ให้เขาเรียกพรรคพวกของเขามา แล้วเราจะเรียกผู้คุมนรก (ซะบานิยะฮ์) มาจัดการ ดังนั้นเจ้าอย่าได้เชื่อฟังเขา แต่จงสุญูดและเข้าใกล้ชิดพระองค์เถิด"
      }],
    "content_detail": "“อัลอะลัก” หมายถึง ก้อนเลือด นำมาจากอายะฮ์ที่สอง สูเราะฮ์นี้คือจุดเริ่มต้นของหน้าประวัติศาสตร์อิสลาม มีอายะฮ์อัสสัจดะฮ์ในอายะฮ์สุดท้าย (อายะฮ์ที่ 19) ซึ่งสั่งให้ทำการสุญูดทันทีเมื่ออ่านจบ"
  },
  {
    "surah_id": "97",
    "name": "Al-Qodar",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 5,
    "thematic_ayat": [{
        "ayat_range": "1",
        "theme": "แท้จริงเราได้ประทานอัลกุรอานลงมาในคืนอัลก็อดร์ (คืนแห่งเกียรติยศและกำหนดสภาวะ)"
      },
      {
        "ayat_range": "2-3",
        "theme": "และเจ้ารู้ไหมว่าคืนอัลก็อดร์คืออะไร? คืนอัลก็อดร์นั้นดีเลิศยิ่งกว่าหนึ่งพันเดือน (ที่ไม่มีคืนนี้อยู่ภายใน)"
      },
      {
        "ayat_range": "4",
        "theme": "บรรดามะลาอิกะฮ์และวิญญาณ (ญิบรีล) จะหลั่งไหลลงมาในคืนนั้นโดยอนุมัติแห่งพระเจ้าของพวกเขาเพื่อจัดการในทุก ๆ กิจการ"
      },
      {
        "ayat_range": "5",
        "theme": "คืนนั้นมีความศานติและปลอดภัยจนกระทั่งรุ่งอรุณปรากฏ"
      }],
    "content_detail": "“อัลก็อดร์” หมายถึง เกียรติยศ มหาอำนาจ หรือการกำหนดสัดส่วน เนื้อหาทั้งหมดของสูเราะฮ์นี้อุทิศให้กับการอธิบายความประเสริฐอันยิ่งใหญ่ของค่ำคืนลึกลับในเดือนรอมฎอน ซึ่งเป็นคืนที่อัลกุรอานถูกประทานลงมาจากเลาฮิลมะห์ฟูซสู่ฟากฟ้าดุนยา"
  },
  {
    "surah_id": "98",
    "name": "Al-Baiyinah",
    "reveal": "มะดะนิยะฮ์",
    "max_ayat": 8,
    "thematic_ayat": [ {
        "ayat_range": "1-3",
        "theme": "สภาพของพวกปฏิเสธศรัทธาในหมู่ชาวคัมภีร์และพวกตั้งภาคีว่าจะไม่ยอมผละออกจากความหลงผิดจนกว่าจะมีหลักฐานอันชัดเจนมายังพวกเขา ซึ่งก็คือเราะซูลจากอัลลอฮ์ (นบีมุฮัมมัด) ที่มาอ่านคัมภีร์อันบริสุทธิ์ ภายในมีบทบัญญัติอันเที่ยงตรง"
      },
      {
        "ayat_range": "4-5",
        "theme": "พวกชาวคัมภีร์มิได้แตกแยกกันเว้นแต่หลังจากที่มีหลักฐานมาถึงพวกเขา ทั้งที่พวกเขา มิได้ถูกสั่งใช้ให้กระทำสิ่งใด นอกจากการเคารพภักดีต่ออัลลอฮ์อย่างบริสุทธิ์ใจ ดำรงละหมาด และบริจาคซะกาต นั่นคือศาสนาอันเที่ยงตร"
      },
      {
        "ayat_range": "6",
        "theme": "แท้จริงบรรดาผู้ปฏิเสธในหมู่ชาวคัมภีร์และพวกตั้งภาคีจะอยู่ในไฟนรกญะฮันนัมตลอดกาล คนเหล่านี้คือ 'มนุษย์ที่ชั่วช้าที่สุด'"
      },
      {
        "ayat_range": "7-8",
        "theme": "แท้จริงบรรดาผู้ศรัทธาและทำความดี คนเหล่านี้คือ 'มนุษย์ที่ประเสริฐที่สุด' รางวัลของพวกเขา ณ พระเจ้าคือสวนสวรรค์อันสถาพร มีตาน้ำพุไหลผ่านตลอดกาล อัลลอฮ์ทรงพึงพอพระทัยในพวกเขาและพวกเขาก็พึงพอใจในพระองค์ นั่นสำหรับผู้ที่เกรงกลัวพระเจ้าของตน"
      }],
    "content_detail": "“อัลบัยยินะฮ์” หมายถึง หลักฐานอันชัดแจ้ง เป็นสูเราะฮ์ที่จำแนกประเภทของมนุษย์ในมุมมองของอิสลามออกเป็นสองขั้วอย่างชัดเจน คือ ผู้สร้างความเสียหายและปฏิเสธ (ชัรรุลบะรียะฮ์) กับผู้ศรัทธาทำความดี (ค็อยรุลบะรียะฮ์)"
  },
  {
    "surah_id": "99",
    "name": "Az-Zalzalah",
    "reveal": "มะดะนิยะฮ์",
    "max_ayat": 8,
    "thematic_ayat": [ {
        "ayat_range": "1-3",
        "theme": "เหตุการณ์แผ่นดินไหวครั้งสุดท้าย: เมื่อแผ่นดินถูกสั่นสะเทือนอย่างรุนแรง และแผ่นดินได้ขับสิ่งหนักและสสารภายใน (ศพและขุมทรัพย์) ออกมา และมนุษย์ร้องอุทานด้วยความตื่นตระหนกว่า 'เกิดอะไรขึ้นกับมัน?'"
      },
      {
        "ayat_range": "4-5",
        "theme": "ในวันนั้นแผ่นดินจะรายงานข่าวคราวของมัน ตามที่พระเจ้าของเจ้าทรงดลใจแก่มัน (รายงานทุกการกระทำของมนุษย์บนหน้าดิน)"
      },
      {
        "ayat_range": "6-8",
        "theme": "วันที่มนุษย์แยกย้ายกันมาเป็นกลุ่ม ๆ เพื่อดูผลงานของตน: ดังนั้นผู้ใดกระทำความดีหนักเท่าผงธุลี เขาก็จะได้เห็นมัน และผู้ใดกระทำความชั่วหนักเท่าผงธุลี เขาก็จะได้เห็นมัน"
      }],
    "content_detail": "“อัซซัลซะลาฮ์” หมายถึง แผ่นดินไหวรุนแรง นำมาจากอายะฮ์แรก เป็นสูเราะฮ์สั้น ๆ ที่สั่นสะเทือนหัวใจมนุษย์ให้ตระหนักถึงความละเอียดถี่ถ้วนของการชำระบัญชีในวันกิยามะฮ์ ซึ่งไม่มีความดีหรือความชั่วใด ๆ แม้เพียงมดตัวเล็ก ๆ จะถูกละเลย"
  },
  {
    "surah_id": "100",
    "name": "Al-Adiyat",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 11,
    "thematic_ayat": [ {
        "ayat_range": "1-5",
        "theme": "คำสาบานด้วยภาพการทำสงครามอันดุดัน: สาบานด้วยม้าศึกที่วิ่งหอบระรัว, ม้าศึกที่ประกายไฟพวยพุ่งจากกีบเท้ากระทบหิน, ม้าศึกที่จู่โจมในยามเช้าตรู่ จนทำให้ฝุ่นฟุ้งกระจาย และบุกตะลุยเข้าไปใจกลางกองทัพของศัตรู"
      },
      {
        "ayat_range": "6-8",
        "theme": "จุดประสงค์ของการสาบานเพื่อเปิดโปงจิตใจมนุษย์: แท้จริงมนุษย์นั้นเนรคุณต่อพระเจ้าของตน และแท้จริงเขาขอมันเป็นพยานยืนยันได้ และแท้จริงเขามีความรักอย่างรุนแรงต่อทรัพย์สินเงินทอง"
      },
      {
        "ayat_range": "9-11",
        "theme": "คำเตือนสติ: เขาไม่รู้หรือว่าเมื่อสิ่งที่อยู่ในหลุมฝังศพถูกพลิกกลับกระจัดกระจาย และสิ่งที่ซ่อนอยู่ในทรวงอกถูกเปิดเผยแยกแยะ แท้จริงพระเจ้าของพวกเขาในวันนั้นย่อมทรงรอบรู้อย่างถี่ถ้วนเกี่ยวกับพวกเขา"
      }],
    "content_detail": "“อัลอาดียาต์” หมายถึง บรรดาม้าศึกที่วิ่งเร็ว นำมาจากคำแรกของสูเราะฮ์ ใช้ถ้อยคำที่มีจังหวะรวดเร็วรุนแรงดั่งม้าศึก เพื่อกระตุกเตือนมนุษย์ให้ตื่นจากความหลงใหลในทรัพย์สินดุนยาและหันมาเตรียมพร้อมสำหรับวันเปิดเผย"
  },
  {
    "surah_id": "101",
    "name": "Al-Qoriah",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 11,
    "thematic_ayat": [ {
        "ayat_range": "1-3",
        "theme": "มหาภัยพิบัติอันสั่นสะเทือน! และเจ้ารู้ไหมว่ามหาภัยพิบัติอันสั่นสะเทือนนั้นคืออะไร? วันแห่งการทุบตีและเคาะจิตใจมนุษย์ให้ตื่นตัว"
      },
      {
        "ayat_range": "4-5",
        "theme": "สภาพในวันนั้น: มนุษย์จะมีสภาพกระจัดกระจายประหนึ่งฝูงแมลงเม่าที่บินว่อน และขุนเขาภูเขาต่าง ๆ จะมีสภาพแตกสลายปลิวว่อนดั่งขนสัตว์ที่ถูกจักฟูง"
      },
      {
        "ayat_range": "6-9",
        "theme": "สัจธรรมการชั่งตาชั่ง: ผู้ใดที่ตราชั่งความดีของเขาหนักพูน เขาก็จะได้อยู่ในวิถีชีวิตอันผาสุกสำราญในสวรรค์ ส่วนผู้ที่ตราชั่งความดีของเขาเบาโหวง ที่พำนักและแม่ของเขาก็คือ 'ฮาวียะฮ์'"
      },
      {
        "ayat_range": "10-11",
        "theme": "และเจ้ารู้ไหมว่าฮาวียะฮ์นั้นคืออะไร? มันคือไฟอันร้อนจัดและโชติช่วงยิ่ง"
      }],
    "content_detail": "“อัลกอริอะฮ์” หมายถึง มหาภัยพิบัติอันสั่นสะเทือน หรือ วันแห่งเสียงกัมปนาทที่เคาะโสตประสาท นำมาจากคำแรกของสูเราะฮ์ วาดภาพความโกลาหลของวันสิ้นโลกและการแยกแยะบั้นปลายมนุษย์ด้วยความหนักเบาของความดี"
  },
  {
    "surah_id": "102",
    "name": "At-Takasur",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 8,
    "thematic_ayat": [
      {
        "ayat_range": "1-8",
        "theme": "ความเพ้อฝันต่อดุนยา ความตาย และการสอบสวนในความโปรดปรานที่ได้รับ"
      }
    ],
    "content_detail": ""
  },
  {
    "surah_id": "103",
    "name": "Al-Ashr",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 3,
    "thematic_ayat": [
      {
        "ayat_range": "1-3",
        "theme": "คุณลักษณะของมนุษย์ที่ไม่ขาดทุน"
      }
    ],
    "content_detail": "“อัลอัศรฺ” เป็นสูเราะฮ์ที่สั้น แต่ยิ่งใหญ่และมีบทเรียนมากมาย ท่านอบูหุซัยฟะฮ์ เราะฎิยัลลอฮุอันฮุ ได้กล่าวว่า : เมื่อเศาะหาบะฮ์ 2 คนของท่านเราะซูลุลลอฮ์พบเจอกัน พวกเขาจะไม่แยกจากกัน นอกจากว่าคนหนึ่งจะอ่านสูเราะฮ์อัลอัศรฺให้กับอีกคนหนึ่ง แล้วหลังจากนั้นพวกเขาก็จะให้สลามกัน อิมามอัชชาฟิอีย์ เราะหิมะฮุลลอฮ์ กล่าวว่า “หากอัลลอฮ์มิได้ประทานหลักฐานใด ๆ แก่สิ่งถูกสร้างของพระองค์เลยนอกจากสูเราะฮ์นี้ มันก็เพียงพอแล้วสำหรับพวกเขา”"
  },
  {
    "surah_id": "104",
    "name": "Al-Humazah",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 9,
    "thematic_ayat": [
      {
        "ayat_range": "1-9",
        "theme": "บั้นปลายในโลกหน้าของผู้ที่ชอบนินทาและใส่ร้ายผู้อื่น"
      }
    ],
    "content_detail": "สูเราะฮ์ “อัลฮุมะซะฮ์” ถูกประทานลงมา เพื่อตำหนิผู้ที่ชอบนินทา (ฮุมะซะฮ์) และใส่ร้ายผู้อื่น (ลุมะซะฮ์) มีรายงานที่แตกต่างกันเกี่ยวกับสาเหตุของการประทานสูเราะฮ์นี้ ไม่ว่าจะเป็นใครก็ตาม แกนนำชาวกุร็อยช์ส่วนใหญ่ล้วนแล้วเป็นคนที่ชอบนินทาและใส่ร้ายท่านนบีและบรรดาเศาะหาบะฮ์"
  },
  {
    "surah_id": "105",
    "name": "Al-Fil",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 5,
    "thematic_ayat": [
      {
        "ayat_range": "1-5",
        "theme": "เรื่องราวของกองทัพช้าง"
      }
    ],
    "content_detail": "สูเราะฮ์ “อัลฟีล” หรือสูเราะฮ์ “ช้าง” เป็นสูเราะฮ์ที่กล่าวถึงเหตุการณ์สำคัญในยุคญาฮิลิยะฮ์ เมื่อ “อับเราะฮะฮ์ อัลอัชร็อม” กษัตริย์แห่งเยเมนได้ยกกองทัพขนาดใหญ่พร้อมช้างหลายสิบตัวมาที่เมืองมักกะฮ์เพื่อทำลายอาคารกะอ์บะฮ์ แต่องค์อัลลอฮ์ทรงทำลายกองทัพของเขาจนสิ้นซากด้วย “นกอะบาบีล” กระทั่งบัยตุลลอฮ์และเมืองมักกะฮ์ได้รับการปกป้องและปลอดภัย และในปีที่เกิดเหตุการณ์นี้เองที่ท่านนบีมุฮัมมัดถือกำเนิดขึ้นมา"
  },
  {
    "surah_id": "106",
    "name": "Quroisy",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 4,
    "thematic_ayat": [
      {
        "ayat_range": "1-4",
        "theme": "ความโปรดปรานของอัลลอฮ์แก่ชาวกุร็อยช์ และคำเรียกร้องให้พวกเขาเคารพภักดีต่อพระองค์"
      }
    ],
    "content_detail": "“กุร็อยช์” คือเผ่าอาหรับที่มีชื่อเสียงที่สุดของคาบสมุทรอาหรับในอดีต พวกเขาอาศัยอยู่ที่บริเวณเมืองมักกะฮ์ ได้รับความไว้วางใจให้ดูแลอาคารกะอ์บะฮ์ และเป็นเผ่าของท่านนบีมุฮัมมัด ศ็อลลัลลอฮุ อะลัยฮิ วะสัลลัม ใจความสำคัญของสูเราะฮ์นี้คือ การพูดถึงวิถีชีวิตของชาวกุร็อยช์ ที่มักจะเดินทางไปค้าขายที่แผ่นดินเยเมนในช่วงฤดูหนาว และที่แผ่นดินชามในช่วงฤดูร้อน เป็นความโปรดปรานของอัลลอฮ์ที่พวกแคว้นควรแสดงความขอบคุณ ด้วยการอิบาดะฮ์ต่อพระองค์เพียงผู้เดียวเท่านั้น ไม่ใช่การตั้งภาคีต่อพระองค์"
  },
  {
    "surah_id": "107",
    "name": "Al-Maun",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 7,
    "thematic_ayat": [],
    "content_detail": ""
  },
  {
    "surah_id": "108",
    "name": "Al-Kautsar",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 3,
    "thematic_ayat": [],
    "content_detail": ""
  },
  {
    "surah_id": "109",
    "name": "Al-Kafirun",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 6,
    "thematic_ayat": [],
    "content_detail": ""
  },
  {
    "surah_id": "110",
    "name": "An-Nashr",
    "reveal": "มะดะนิยะฮ์",
    "max_ayat": 3,
    "thematic_ayat": [],
    "content_detail": ""
  },
  {
    "surah_id": "111",
    "name": "Al-Masad",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 5,
    "thematic_ayat": [],
    "content_detail": ""
  },
  {
    "surah_id": "112",
    "name": "Al-Ikhlas",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 4,
    "thematic_ayat": [],
    "content_detail": ""
  },
  {
    "surah_id": "113",
    "name": "Al-Falak",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 5,
    "thematic_ayat": [],
    "content_detail": ""
  },
  {
    "surah_id": "114",
    "name": "An-Nas",
    "reveal": "มักกิยะฮ์",
    "max_ayat": 6,
    "thematic_ayat": [],
    "content_detail": ""
  }
];
